["The fall of Roe v. Wade has pushed the U.S. into а serius problem .\nCatherine told The New York Times in an interview that she had become pregnant when she was 16, and, without the option of a safe, legal abortion, she gave her baby up for adoption. She was 17 when she attended her first demonstration to push for abortion. Starr went to the rally because she “wanted to be able to make sure that the next little girl that gets pregnant has an option,” she said.\nWilliam E. Sauro documented scenes inside Women's Medical Services, an abortion clinic, and Librado Romero took pictures of workers inside the Women’s National Abortion Action Coalition office in New York.\nIn 1981,John Sotomayor captured abortion rights activists dancing at a demonstration in Manhattan to commemorate the eighth anniversary of the Supreme Court’s decision.\nread more about the women who were on the front lines of the abortion rights movement before Roe was the law and shortly after the ruling.", "Illinois may stand alone as a principal abortion access for a swath of the Midwest and the South as neighboring states have banned, or are moving to ban, the procedure they have immediately banned abortion after the Supreme Court’s decision on Friday, and two others now restrict the procedure to no more than six weeks into a pregnancy.\nThere are 29 abortion providers, but as clinics in surrounding states stop providing abortions or close altogether, these providers say they may not be able to meet the demand.", "After the overturning of Roe v. Wade, many women are wondering how to reorder their lives after the constitutional right to abortion was erased.\nSome women,  reveled in the decision, believing it to be a moral and legal victory. But a poll released on Sunday showed that a majority of women in the U.S. — 67% — opposed the Supreme Court’s ruling, and 52% of Americans said it was a step backward for the nation.\nIn dozens of interviews this week, American women who support abortion rights recalled the moment when they heard that Roe had been overturned. They reflected on how access to legal abortion had quietly undergirded their personal decisions, even if they had never sought one themselves. They worried that the progress many women have made since abortion was legalized — in education, in the workplace and in the culture — would be halted.\nAnd they reconsidered their own plans and those of their children in states where abortion has been banned; how they could help other women with unwanted pregnancies; and whether they would ever recover the constitutional right to receive a safe abortion, a guarantee that tens of millions of women have known their entire lives.", "After the Supreme Court overturned Roe v. Wade on Friday, eliminating the constitutional right to abortion, demonstrators and activists flocked to the courthouse. An outpouring of outrage and grief from some collided with expressions of joy and relief from others.\nSome protesters linked arms with their mouths taped shut, posing silently with signs expressing anger about the decision. Still others cheered the decision, shirts that read “The Pro-Life Generation Votes” and rallying together in a separate group to commemorate the ruling.\nBy the afternoon, as more people learned of the decision, a crowd overwhelmingly in favor of abortion rights had coalesced around the court’s front steps, chanting slogans aimed at the court’s conservative majority.", "The Supreme Court  overruled Roe v. Wade, eliminating the constitutional right to abortion after almost 50 years in a decision that will transform American life, reshape the nation’s politics and lead to all but total bans on the procedure in about half of the states.\nThe decision, which echoed a leaked draft opinion published by Politico in early May, will result in a starkly divided country in which abortion is severely restricted or forbidden in many red states but remains freely available in most blue ones.\nChief Justice John G. Roberts Jr. voted with the majority but said he would have taken “a more measured course,” stopping short of overruling Roe outright. The court’s three liberal members dissented.", "Every year, hundreds of thousands of women turn to Google to find abortion services. Many of those searches lead to paid ads for local “women’s clinics,” whose goal is to try to change their minds.\nThe New York Times found dozens of websites that mimic the look and feel of abortion provider sites, and traced them to Human Coalition, an anti-abortion group that is quietly orchestrating a national effort to end abortion. Using local numbers that route to anti-abortion call centers and the promise of free ultrasounds, the organization seeks to intercept newly pregnant women and persuade them to keep their babies.\nHuman Coalition has earned lucrative contracts to provide alternatives to abortion. \nWith a decision on Roe v. Wade looming, the abortion landscape across the U.S. is set to be fundamentally altered — and organizations like Human Coalition are planning to seize the moment to expand.", "The Planned Parenthood clinic has seen an increase in abortion patients , while trying to keep up with increasingly severe restrictions in its own state.\nThe center has seen a steady influx since September, when a ban on all but the earliest abortions took effect there, and from other states that have tightened access to the procedure over the past year. It is also adjusting to a waiting period that took effect in Florida in April after years of litigation, requiring patients seeking an abortion to have an ultrasound and then return at least 24 hours later for the procedure. And a new state law banning most abortions after 15 weeks of pregnancy is set to take effect July 1, although Planned Parenthood and other abortion providers in the state have sued to try to block it.\nOn top of those changes, the Supreme Court is poised to issue a ruling that could overturn Roe v. Wade, the 1973 ruling legalizing abortion throughout the U.S. Florida is not one of the 13 states with so-called trigger laws, which would quickly ban nearly all abortions if Roe was overturned. \nMost patients in Florida get medication abortions. The center also provides surgical abortions generally up until about 24 weeks of pregnancy — at least until the new law takes effect. It also provides pelvic and breast exams, different types of contraception and other reproductive health care.", "A Florida law banning abortions after 15 weeks of pregnancy violates privacy protections in the State Constitution, a state judge ruled on Thursday, a day before the new restrictions were to take effect.\nJudge John Cooper of the Second Judicial Circuit Court in Tallahassee ruled from the bench that the law, signed by Gov. Ron DeSantis in April, will not be enforced for now. Florida currently allows abortions until 24 weeks, making the state a refuge for women seeking the procedure from across Southeastern states with tighter restrictions.\nJudge Cooper said he would issue a temporary statewide injunction.", "Two days after the Supreme Court overturned Roe v. Wade, a 27-year-old woman delivered her fourth child. The woman, had fled domestic abuse and been denied an abortion. Her son is among the first of many babies expected in a post-Roe .\nOne in 10 people of reproductive age in America, which will soon outlaw almost all abortions. The state is one of the most dangerous in the nation to have a baby, with high maternal and infant mortality rates. Texas’ conservative leadership has spent decades restricting abortion access while cutting social spending and publicly funded health care. Now, even some anti-abortion advocates say their state is woefully unprepared for a likely surge in births among poor women.\nSome anti-abortion crisis pregnancy centers have come under scrutiny for misleading or misinforming women seeking abortion care. “We do want to limit abortions,” said Aubrey Schlackman, the founder of Blue Haven Ranch, a Christian nonprofit that is providing housing and other assistance for T.’s family. “But we personally weren’t ready to handle an influx, and I know so many of the other nonprofits that we work with aren’t ready for that, either.” Schlackman accompanied T. to a birthing center to provide support when she went into labor, and Blue Haven supporters purchased everything on T.’s baby registry. The nonprofit will offer assistance for at least another year.\nT. has a message for Texas legislators: “You don’t know what is best for any family. You didn’t protect me or my kids. I protect my kids. Only a mom can know what is best for herself and her family. And if you’re going to force women to have all of these babies that they are not equipped to have, then you need to provide support for women and their children after the babies are born.”", "", "The scars of our warming planet are everywhere — from rising sea waters to melting glaciers and charred forests. But climate change is also inflicting a growing, unseen toll on life.\nIn February, a major new study highlighted the live effects of climate change for the first time, finding that anxiety and stress from a changing climate were likely to increase in coming years.\nIn addition to those who have lost their homes to floods and megafires, millions have endured record-breaking heat waves. The crisis also hits home in subtle, personal ways — withered gardens, receding lakeshores and quiet walks without the birdsong that once accompanied them.\nTo understand what the effects of climate change feel like The New York Times heard from hundreds of people. In cities already confronting the long-term effects of a warming planet, and in drought-scarred ranches and rangeland, peoples are trying to cope with the strain of an increasingly precarious future.  Britt Wray, a Stanford University researcher and author of “Generation Dread,” a forthcoming book about grappling with climate distress.", "A winter storm blew across the Northeast overnight on Friday, dropping the first significant snowfall of the winter and creating treacherous conditions for the morning commute.\nSnow fell heavily in the pre-dawn hours iand parts of New England, causing flight delays and cancellations at airports and slowing traffic and train service. ", "A string of unseasonably powerful storms and tornadoes swept across five states.\n“This has been the most devastating tornado event in our state’s history,” Gov. Andy Beshear of Kentucky said in a news briefing. “The level of devastation is unlike anything I have ever seen.”\nThe storms — dark and immense funnel clouds that roared across the nighttime landscape — obliterated homes, churches and businesses, leaving unearthly scenes of devastation. In Mayfield, Ky., which was among the hardest-hit communities, the center of town had become a perilous maze of downed utility lines, dangling tree limbs and scattered debris.", "Viewed from the sea, Svalbard seems to be the very epitome of wilderness: a vast expanse of largely untouched water, ice and islands, free from human habitation and infrastructure, aside from the occasional passing boat.\nUnfortunately, climate change all but guarantees an eventual (and probably fairly imminent) collapse of what is an exceptionally fragile ecosystem, Westberg writes.\nThe 29 national parks, as well as other protected areas that cover two-thirds of the Svalbard archipelago, can protect its wild inhabitants from hunting and pollution, but not from increasing water and air temperatures. Every year brings further news of ever-shrinking glaciers and reduced ice cover — ice upon which the 3,000 polar bears who live in the Svalbard archipelago and Barents Sea depend for their survival.\nTourism, as is so often the case, is simultaneously part of the problem and part of the solution.", "Yes, summers are getting hotter.\nThis animating chart, originally published in 2017, shows how summer temperatures have become hotter and more extreme in recent decades. It is based on data from James Hansen, a retired NASA climate scientist and professor . To create the curves, Hansen and two colleagues compared actual summer temperatures across the world for each decade since the 1980s to a fixed baseline average.\nDuring their base period, 1951 to 1980, about a third of local summer temperatures across the Northern Hemisphere were in a “near average” or normal range. A third were considered cold, a third were hot, and only a few values could be found at the extremes. Since then, summer temperatures have shifted drastically, the researchers found. Between 2005 and 2015, two-thirds of temperatures were in the hot category, and nearly 15% could be considered “extremely hot.”", "Likening climate change to a emergency, “The tragedy is that this is not a movie and the doomsday device is real,” he said. “Humanity has long since run down the clock on climate change. It is one minute to midnight on that doomsday clock, and we need to act now.”\nUnderscoring the urgency of the moment, with leaders of more than 120 countries facing pressure to immediately curb greenhouse gas emissions, the United Nations secretary general, António Guterres, said that the effects of a warming planet were already being felt “from the ocean depths to the mountaintops.”\n“Sea level rise has doubled from 30 years ago,” he said. Oceans are hotter than ever, parts of the Amazon rainforest emit more carbon than they absorb, and in the last decade about four billion people were affected by events related to the changing climate.\nThe aim is to prevent the average global temperature from rising more than 1.5 degrees Celsius compared with levels before the Industrial Revolution. That is the threshold beyond which scientists say the dangers of global warming — such as deadly heat waves, water shortages, crop failures and ecosystem collapse — grow immensely.", "More than six inches of rain fell over Yosemite National Park in California over a 36-hour period, causing Yosemite Falls to surge Tuesday after a dry and drought-stricken summer.\n“We had quite a storm,” the park said.\nAlthough the park said it did not have direct measurements, it said that “sensors suggest a few feet of snow fell at the higher elevations,” and that the snow level for much of the storm “was high,” which caused rivers and creeks “to rise substantially.” The Merced River at the Pohono Bridge rose 8.5 feet, the park said, noting it was 1.5 feet below flood stage.\nAt 2,425 feet high, Yosemite Falls is the tallest waterfall in North America. Its peak flow usually occurs in May, after most of the park’s snow melts, but by August it often slows to a trickle or is completely dry. Storms in the late fall can help restore the falls.\nThe rainfall at Yosemite was the result of two storms that converged in the Bay Area, bringing floods, high winds and some much-needed rain to , which has wrestled with large wildfires and severe drought conditions that have been brought on by climate change.", "Three years after Greta Thunberg’s strike against climate change began \"Last week, some of the world’s leading climate change scientists confirmed that humans are making irreversible changes to our planet and extreme weather will only become more severe,” write “This news is a 'code red for humanity,' said the United Nations secretary general. It is — but young people like us have been sounding this alarm for years. You just haven’t listened.\" ⁣\nA new UNICEF analysis will be released on Friday, the three year anniversary of Thunberg’s lone protest outside the Swedish Parliament, providing a comprehensive view of where and how this crisis affects people.\n\"The fundamental goal of the adults in any society is to protect their young and do everything they can to leave a better world than the one they inherited,\" write the youth climate activists. \"The current generation of adults, and those that came before, are failing at a global scale.\" ⁣", "For weeks, the wildfires in Northern California — which have so far burned more than 1.3 million acres of land — have mostly skipped across sparsely populated areas and have not required mass evacuations.⁣\nBut the Caldor fire, which began east of Sacramento over the weekend, has changed t As of Wednesday evening, the uncontained blaze had forced about 23,000 residents of El Dorado County to leave their homes. Nearly a third of those evacuations were confirmed  in a space of less than six hours.\nThe overall statewide evacuation figure stood at more than 35,000 people as of Wednesday night. That included more than 7,000 residents who had fled the Dixie fire, the second-largest blaze in California’s recorded history. ⁣\nThe Dixie fire is one of at least six large blazes in Northern California and has so far burned more than 662,000 acres over four counties since it emerged in mid-July. It was 35% contained on Wednesday, up from 31% a day earlier.⁣\nBut the wildfires burning in Northern California are affecting more people than simply those forced to evacuate.  air pollution was projected to remain at unhealthy levels — above 150 on the air quality index — in Sacramento and other cities near the blaze.⁣", "This island is the new epicenter of Europe’s summer of calamity.\nFires on Evia, have destroyed 120,000 acres of forest, razed homes and displaced hundreds of people. They have brought assistance from more than 20 countries and been declared “a natural disaster of unprecedented dimensions” .\nThe fires, fueled by a record-breaking heat wave that has touched temperatures of up to 46 degrees Celsius, or 115 degrees Fahrenheit, have caused economic disaster and almost biblical scenes of destruction. But they seem less a random act of God than another inevitable episode of Europe’s extreme weather brought on by climate change.\nVirtually no corner of Europe has been untouched by a bewildering array of calamities, whether fire, flood or heat. “It’s not just Greece,” said Vasilis Vathrakoyiannis, a spokesman for the Greek fire service. “It’s the whole European ecosystem.”\nThe shifting epicenter of natural disaster has now fallen on Evia, a densely wooded island, once best known for its beekeepers and resin producers, its olive groves and seaside resorts.", "Last month was the hottest June on record .\nMore than 1,200 daily temperature records were set in the final week alone. But there was an even greater number of daily records set by a different — and maybe more dangerous — measure: overnight temperatures. 1,503 records were broken that same week. The higher nighttime temperatures are part of a global trend fueled by climate change.\nThe extreme temperatures that scorched the Pacific Northwest in late June led to nearly 200 deaths in Oregon and Washington State as people struggled to keep cool in poorly air-conditioned homes, on the street and in fields and warehouses.\nThe same “heat dome” effect that enveloped the Northwest — in which hot, dry ground traps heat and accelerates rising temperatures — descended on California and parts of the Southwest this weekend. The temperature in Death Valley reached 130 degrees Fahrenheit, one of the highest temperatures ever recorded on Earth, matching a similar one from August 2020.", "The extraordinary heat wave that scorched the Pacific Northwest last week would almost certainly not have occurred without global warming, an international team of climate researchers said Wednesday.\nTemperatures were so extreme — including readings of 116 degrees Fahrenheit in Portland, Oregon, and a Canadian record of 121 in British Columbia — that the researchers had difficulty saying just how rare the heat wave was. But they estimated that in any given year there was only a 0.1 percent chance of such an intense heat wave occurring.\n“Although it was a rare event, it would have been virtually impossible without climate change,” said Geert Jan van Oldenborgh of the Royal Netherlands Meteorological Institute, who conducted the study with 26 other scientists. Friederike Otto, one of the researchers from Oxford University in England, said, “For heat waves, climate change is an absolute game changer.”\nTemperature records for cities and towns in the region were broken, and by a much larger margin than the researchers had ever seen in a heat wave. Perhaps, they said, the climate was passing a threshold to a point where just a relatively small rise in global temperatures could greatly increase the likelihood of a big jump in extreme heat.\n“We are worried,” van Oldenborgh said. “We are much less certain about how heat waves behave than we were two weeks ago.”\n \nThis Earth Day, take a minute to learn what we can do to help build a better future for our planet. Through the use of fossil fuels like coal, oil and gas, humans are causing CO2 levels to rise and at an unprecedented rate. This could lead to up to an increase of average global temperatures of 9 degrees Fahrenheit by the end of this century, great disturbances in ecosystems, and millions of people suffering from water scarcity and crop failures.\nIf we continue down the path we’re on, the planet will keep getting hotter and the effects of climate change will get worse. While the science on climate change is settled, the future is not.\n", "\"I live with bipolar disorder in Ghana, where the COVID19 pandemic has been an unprecedented stressor to the mental health . I have many friends who had relapses in their mental health because of the increased levels of fear and panic. It was almost as if fear was contagious.\nIn Ghana health care workers, people with COVID-19  are experiencing psychological distress and mental health symptoms as a result of the pandemic.\nMost people are afraid to seek help because they think that if they visit the hospital, they might end up getting infected with COVID-19 because of the virus’ subtle mode of transmission and contraction. I myself did not go to the clinic for therapy for an entire year partly because of this fear. I was also unemployed at the time and did not have the funds for treatment. But my pensioner parents managed to make sure my medications were always refilled.\nI have been privileged to have a good system of support. But it is not the same for others. Some people could not afford treatment. It was and still is a very difficult time. The impact of COVID-19 on mental health cannot be underestimated.", "We currently have a good supply of #COVID19 vaccines. everywhere at highest risk of severe disease - including health workers and older people - should be vaccinated with a full course of doses.", "When people don't get vaccinated, viruses and bacteria are more likely to spread. Vaccinations help protect you & people around you. ", "Vaccines accompany us through different stages of our lives and protect against:\nCervical cancer\nCholera\nCOVID-19\nDiphtheria\nEbola\nHep B\nInfluenza\nJapanese encephalitis\nMeasles\nMeningitis\nMumps\nPertussis\nPneumonia\nPolio\nRabies\nRotavirus\nRubella\nTetanus\nTyphoid\nVaricella\nYellow Fever", "released an updated Strategic Preparedness, Readiness and Response Plan for #COVID19 - hopefully the last one. It lays out 3 possible scenarios for how the pandemic could evolve this year and how to respond. We have all the tools we need to bring this pandemic under control.", "In the last week alone, almost 75,000 deaths from #COVID19 were reported to WHO.\nDr Maria Van Kerkhove elaborates on Omicron and its sub-lineages transmission and severity", "Omicron is a variant of the virus that causes #COVID19. To protect yourself and others:⁣\n💉 Get vaccinated as soon as it's your turn⁣\n😷 #WearAMask⁣\n↔️ Keep physical distance and avoid crowds⁣\n🪟 Open windows⁣\n💪 Cough/sneeze into your elbow⁣\n👐 Clean your hands", "Recirculating indoor air can increase the spread of the virus that causes #COVID19.⁣\n⁣\nGood ventilation protects you from infection. ", "you can be vaccinated against #COVID19.\nYou are at high risk of serious illness or delivering your prematurely if you get sick with COVID-19.\n", " these festive Passover recipes will become part of your regular rotation.\nThe meal that follows is a bit like Thanksgiving in the sense that certain dishes, like matzo ball soup and gefilte fish, are nonnegotiable. But there are other parts of the menu that can be tweaked. And what a good year to try something new and perhaps a bit more exciting than the usual.\n📸 In this roasted chicken dish, dried apricots and green olives contribute their sweet and sour notes to add real verve.\n📸 A whole roasted cauliflower is incredibly easy and delightfully showstopping. A bright, punchy cilantro and pistachio pesto slathered on top brings freshness and even more color.\n📸 If you are a savory matzo brei person, you will adore this matzo frittata packed with jammy caramelized onions and mushrooms.\n📸 Making tsimmes needn’t be a big fuss. Pop some halved sweet potatoes in the oven to roast and stir up a simple but lip-smacking glaze full of citrus, ginger, honey and prunes to pour over before serving.\n📸 These perfect coconut macaroons, along with some strawberries and perhaps some medjool dates, are dessert enough. They’re the ideal finger foods to eat while reclining with those you love.", "Puttanesca is a sauce that plies its trade all year round, with ingredients — pantry staples like anchovies, garlic and olives — ready whenever the desire strikes. But this puttanesca from @clarkbar takes advantage of spring greens, using fat green garlic cloves and spinach to lend a pungent verdancy to a tried-and-true dish. If green garlic isn’t available, use regular, but use less. It will be equally delicious. Photo by @linda.xiao, with food styling by @monicapierini", "this recipe for mushroom and rice soup may be our happiness.\nMaking creamy soups in a slow cooker can be tricky because it’s not possible to simmer them with the top off and reduce the liquid. But good news: @sarahedigregorio kindly made two versions of her soup, one for the slow cooker and another for the Instant Pot, making it a weeknight possibility.\nUse any variety of mushrooms you like: Cremini (also called bella) are affordable and easy to find and work well, or you can add shiitake or oyster mushrooms for a mix of texture and flavors.\nThis recipe uses rice, which isn’t a true rice at all but the seed of a grass . When it’s cooked, it should be pleasantly chewy and nutty, not hard, and most of the grains should be slightly split open to reveal their creamy insides.", "This avocado salad with herbs and capers from @clarkbar is dead simple to make and wonderfully luscious.  The herbs here are used in two ways, both chopped into a garlicky salsa verde-like dressing, and strewn in whole leaves across the plate.\nChoose your avocados carefully. Look for firm but not rock-hard fruit, without any mushy spots. If you’d like to substitute another variety of avocado for the Hass you can, but the salad may not have the same texture. It’s great as a side dish or an appetizer. Or make it the foundation of a light lunch, with some crusty bread and tangy cheese on the side. ", "this tuna melt can help recreate the experience. @lideylikes’s recipe adds chopped cornichons and whole-grain mustard for a satisfying crunch and vinegary element. Extra-sharp Cheddar is a must, and as with grilled cheese, the key to achieving perfectly melted cheese and golden bread is to toast the sandwich . ", "Food trends come and go, but a bowl of birria with warm corn tortillas will never lose its appeal.\nBirria, a regional stew. The chef Josef Centeno, who grew up eating beef and goat birria, makes a delicious, thickly sauced version based on his Grandma Alice’s recipe, mixing up the proteins by using oxtail, lamb on the bone and even tofu (you can, too). Preparing the adobo takes minuts, as does browning the meat, but it’s worth it for the deep flavors in the final dish. The best way to serve birria is immediately and simply, in a bowl, with some corn tortillas.", "As far as finger foods go, @alexaweibel’s arancini are right up there with the best of them. This recipe employs a simple base of Parmesan risotto that is chilled, rolled, breaded and fried. Serve them with tomato sauce or even pesto.", "For Lunar New Year, try making @genevieve_ko's dumplings two ways: savory, crunchy chile crisp dumplings and sweet, sesame-filled tang yuan floating in ginger soup. ", "There’s nothing more satisfying for breakfast than, chewy bagel. And good news: They are easy to make at home.\n@nytcooking has a handy guide to making perfect bagels. It explains everything, from mixing to forming, boiling to baking. The result is a traditionally chewy, crusty bagel that’s tastier than those puffy dough rings from your store. ", "does is delicious and these cheesy cauliflower toasts are no exception. Adapted from her 2018 cookbook, “Cook Like a Pro,” they are a bit like open-face grilled cheese sandwiches, but with a nutty layer of roasted cauliflower, and spiked with nutmeg and paprika. We made it vegetarian by leaving out the prosciutto, and also lightened up on the cheese. ", "commenter may sum this recipe up best: “Fantastic. One of the best cakes I can remember making.\" ⁣\n@samanthaseneviratne's Earl Grey tea cake has loose tea leaves stirred into buttery batter, adding a sweet, floral essence that’s subtle but lovely. A little dark chocolate and orange zest makes this cake extra special. While you could use chocolate , using chocolate chopped from a bar : The varying sizes of chopped chocolate blend in nicely without overpowering the delicate tea flavor.⁣", "This meat-free dish is a version of aglio e olio pasta, often known as midnight pasta because it can be made quickly with a few pantry staples: garlic, olive oil, red-pepper flakes and pasta. It can take a bit more time because it calls for roasting the garlic first, but doing so adds a complex, mellow flavor to the entire dish. ", "These sweets start with a dense, chewy brownie that’s topped with a layer of creamy peppermint filling, dark chocolate glaze and a sprinkle of crushed peppermints. For the cleanest slices, chill the finished brownies thoroughly, then use a knife to slice them. Dip the knife blade into and wipe it dry with a kitchen towel between each cut, and you’ll be rewarded with clean layers of chocolate, peppermint and glaze.", "@nytcooking’s 50 most popular vegetarian recipes of 2020 — including this mushroom Bourguignon-style stew simmered with pearl onions, wine and carrots by @clarkbar — are a great way to kick off the new year. Photo by @dmalosh, with food styling by @simoncooks.", "These Lemon Sweet Rolls With Cream Cheese Icing from @yossyarefi are a fresh alternative to classic cinnamon rolls", "This dough is adaptable: You can let the dough rise in the refrigerator, instead of at room , so you can serve fresh, warm rolls for breakfast without getting up at the crack of dawn to make them.\nGet the @nytcooking recipe at the link in bio. Photograph by @craigleephoto.", "Caramelized and crunchy on the outside, soft and custardy on the inside, these thick sourdough slices taste like the lovechild of bread pudding and French toast. You want a round or oblong loaf large enough for big pieces and soft enough to absorb the custard. It’s easy to caramelize the French toast in the oven, but the timing depends on your oven and pan, so check it frequently to ensure that it’s good. ", "recipe for this slow cooker sticky toffee pudding. It isn't so much a pudding , but a baked or steamed date cake. @sarahedigregorio uses espresso powder in the cake and sauce to balance the honeyed taste of the dates and brown sugar", "", "After the shooting in Uvalde, Texas, @nytopinion reached out to students across the U.S. to find out how they were affected by it and what, if anything, would help them feel safer at school.\nRebekah Boitey, who recently finished 11th grade at Jack Britt High in Fayetteville, N.C., wrote: “I ache for change. students are being killed in classrooms that are supposed to prepare them for a future. I am angered that lawmakers continue to allow these shootings to happen, and that some even make it easier for them to occur. Adults have abandoned us, the responsibility of protecting ourselves has been passed on to us. We’re told to run in a zigzag pattern to avoid getting shot, and survivors are praised for having the ingenuity to cover themselves with their classmate’s blood. I can’t simply accept this as the way things must be.”\nShe continued, “Like me, hundreds of students took the opportunity to have their voices heard.”", "Thousands of protesters gathered in Washington, D.C., and in cities across the country on Saturday to demonstrate against gun violence.\nWith their signs, chants and mere presence, protesters condemned the recent spate of mass shootings in the United States and renewed a call for federal legislation to limit the use of the military-style weapons.\nOrganized by March for Our Lives,after the mass shooting at Marjory Stoneman Douglas High School in Parkland, , killed 17 and wounded 17.\nThis time, shootings last month that left 10 Black people dead in a Buffalo supermarket and killed 19 schoolchildren and two teachers at Robb Elementary School in Uvalde, Texas.", "students are demanding adults take action on gun violence: They are walking out of schools, leading marches and protesting on the steps of buildings. They want this time to be different.\nThe demands are nationwide: In New York, demonstrators of all ages marched across the Brooklyn Bridge on Thursday to highlight gun violence awareness month. In places like Texas, Oregon and beyond, middle-schoolers organized protests against gun violence by marching out of classrooms. In Los Angeles, high school students rallied on the steps of City Hall carrying signs that read, “School is for learning, not lockdowns” and “Protect our lives.”\nstudents and teenagers have long spoken out against school shootings and called on political leaders to make change and strengthen gun laws. But this has come after a series of mass shootings this year, including a shooting at an elementary school in Uvalde, Texas, that killed 21 people, including 19 students and two teachers. There have been at least 264 mass shootings (defined as a shooting in which four or more people were killed or injured) , according to The Gun Violence Archive, a nonprofit organization.\nOn Saturday, students plan to continue making their voices heard by joining in more than 300 marches in cities for Our Lives. In 2018 this student-led movement brought together hundreds of thousands of people to streets across the globe to call for action on gun violence after the deadly school shooting at Marjory Stoneman Douglas High School in Parkland, Florida.", "Dr. Roy Guerrero, a pediatrician in Uvalde, Texas, described to members of Congress on Wednesday the horrors he saw two weeks ago in the city’s emergency room as he treated wounded and dying students after a gunman killed 21 people in an elementary school classroom.\nDr. Guerrero said he rushed to Uvalde Memorial on May 24 and found parents already outside the building, yelling their children’s names, sobbing and begging for information. vote on a package of gun control measures, including legislation that would prohibit the sale of semiautomatic rifles to people under the age of 21. It would also ban the sale of magazines that hold more than 10 rounds of ammunition. ", "Miah Cerrillo, a fourth-grade student in Uvalde, Texas, who smeared blood from a dead classmate on herself to avoid being targeted by the gunman who killed 19 students and two teachers in her classroom, described the nightmarish attack \nMiah, 11, was among several who testified at the House Oversight Committee’s hearing on gun violence, including the parents of Lexi Rubio, a student who was killed during the attack;  the sole pediatrician in the small town of Uvalde and an alumnus of Robb Elementary; Zeneta Everhart, whose son was injured during the racist gun attack in Buffalo; and a handful of expert witnesses who answered questions from lawmakers.\nIn the pre-recorded video, Miah recounted in vivid detail what happened when the gunman entered her classroom and was asked what she wanted to come from the mass shooting.\n“To have security,” . She shook her head when she was asked if she felt safe at school. “I don’t want it to happen again,” she said.\nMiah’s father, who appeared at the hearing in person on his daughter’s behalf, said that Miah had changed since the shooting. He pleaded for some kind of change to protect students in school.\nThe emotional testimony unfolded hours before the House was scheduled to vote on a package of gun control measures, including legislation that would prohibit the sale of semiautomatic rifles to people under the age of 21 and would ban the sale of magazines that hold more than 10 rounds of ammunition. The bills are all but certain to go nowhere in the evenly divided Senate, where solid Republican opposition means that they cannot draw the 60 votes needed to break through a filibuster.", " in Washington by passing new federal gun safety measures. He called on Congress to stop the sale of assault-style weapons, expand background checks and pass “red flag” laws after last month’s massacres in Texas and New York.\n“We need to ban assault weapons and high capacity magazines,” “And if we can’t ban assault weapons, then we should raise the age to purchase them from 18 to 21, strengthen the background checks.”\nHe also called on Congress to enact safe storage laws, that protects gun manufacturers from liability. The president said the measures were “not about taking away anyone’s guns.” Delivering his address from the Cross Hall, which was lined with candles in honor of the victims of gun violence, Biden described the deep grief that he experienced when he and his wife talked with the families of those killed in the two mass shootings.\n“At both places, we spent hours with hundreds of family members, who were broken, whose lives will never be the same,” he said. ", "Most owners of what calls “military-style assault weapons” would be required to turn over their firearms to a government buyback program under legislation introduced on Monday, which would tighten the country’s already stringent control of firearms.\nThe Canadian government also announced new regulations that will ban the sale, purchase, importation or transfer of handguns. “We are capping the number of handguns in this country,” Prime Minister Justin Trudeau said.\nThe handgun sales ban and the proposed assault weapons law are the latest in a series of steps Trudeau has taken to restrict firearms since 22 people were killed by a gunman in 2020 , in the deadliest rampage in the country’s history. The legislation, which could apply to tens of thousands of firearms, is expected to pass.\nTrudeau’s program echoes a semiautomatic weapons ban and buyback program enacted  in 2019, after a lone gunman stormed two mosques, killing 51 people and injuring dozens of others ", " Robb Elementary School in Uvalde, Texas, on Sunday for about 20 minutes, where they stopped in front of the victims\nWhile in Texas, the first couple are also set to visit with religious leaders and families of the 19 students and two teachers gunned down last week\nLater in the day, the Bidens attended Mass at Sacred Heart Catholic Church. ", "mass shootings. On May 14, a gunman killed 10 people in a supermarket in Buffalo. On Tuesday, 19 children and two adults were killed in Uvalde, Texas. It was the deadliest shooting at an elementary school since the 2012 massacre at Sandy Hook Elementary.\nIn 2017, after a gunman killed 26 people in a Texas church, Nicholas Kristof, a former @nytopinion columnist, outlined how to reduce deadly shootings in America. In the years since, @nytopinion has regularly updated the piece — sometimes weekly — because, tragically, the issue is still relevant, and it will remain so until America tightens its gun safety policies.", "There is no hard data on gun ownership . This household gun ownership proxy was created by taking a weighted average of the percentage of suicides committed with a firearm — a widely used proxy for firearm ownership — and the hunting license rate in ​each state. ​", "19 students and two teachers — were killed by a gunman at Robb Elementary School on Tuesday in Uvalde, Texas, in the country’s deadliest school shooting in a decade.\nMost of the victims were fourth graders in two adjoining classrooms. The city released the names of the victims on Friday.\nAlexandria Aniyah Rubio, 10, was known as Lexi and was an honor student at Robb Elementary School , dreamed of being a lawyer and was “the student every teacher wants,” said her mother, Kimberly Rubio. Maite Yuleana Rodriguez, 10.", "In Uvalde, Texas, some of the worst fears about the police response to the school shooting rampage were confirmed on Friday when state law enforcement officials acknowledged that more than an hour elapsed between when the shooting began and when the police entered the classroom where students were trapped.\nIn an emotional and at times tense news conference, Steven McCraw, the director of the Texas Department of Public Safety, gave the most detailed accounting of the shooting yet, diverging in substantial ways from the original timeline given by officials.\nMost of the time the gunman was at the school, McCraw explained, he was inside the classrooms where nearly all of the killing took place, while as many as 19 police officers waited outside in the school hallway. Multiple people in the classrooms, including at least two students, called 911 over that horrifying stretch, begging for the police to help. But, apparently believing that the suspect had barricaded himself in a classroom and that “there were no students at risk,” the police did not enter the classroom until 12:50 p.m., 78 minutes after the gunman walked inside.\n“From the benefit of hindsight where I’m sitting now, of course it was not the right decision,” McCraw said. “It was the wrong decision. Period.”", " protest gun violence and the recent massacre of 19 students and two teachers in Uvalde, Texas.\nBeto O’Rourke (photo one), a former representative who is running for governor of Texas, spoke during the protest outside the George R. Brown Convention Center where demonstrators carried signs that read “Protect students not guns” and “How many of us have to die?” David Hogg (photo four), a survivor of the 2018 shooting in Parkland, Florida, spoke at the protest too.\n Wayne LaPierre, the head of the N.R.A., opened the convention by calling out “the evil” of the attack in Texas. Then he quickly pivoted to saying that the federal government could not “legislate against evil,” and that President Biden’s gun control proposals would restrict “the fundamental human right of law-abiding Americans to defend themselves.”\n", "Dyke Day LA is not your average Pride event.\n for an afternoon of picnicking, mingling, cheering on drag performances and a puppy costume competition, and more.\nThis annual gathering takes a approach to a month typically packed with corporate-sponsored parties, parades and concerts; one organizer of Dyke Day estimated the crowd at about 1,500. Since its first iteration in 2007, it has gone from a scrappy Eastside alternative to the spectacle of West Hollywood’s Pride celebrations to an essential — if unofficial — event on the city’s Pride calendar, open to “dykes of all genders.” (According to the organizers, that means everyone but cisgender men.)\nThe name asserts that a term once widely taken as a misogynistic and homophobic slur can be seen as a positive, liberating label. This year, though, attendees were split, mostly along generational lines, about whether the word “dyke” suited the moment, when labels like “nonbinary” and “genderqueer” are used to affirm identities that are more fluid.\n“‘Dyke’ is not our generation’s name to reclaim,” said Melanie Marx, 31. “I feel like we’ve reclaimed ‘queer,’ and it’s far more inclusive.”\nBut several people in their 40s, 50s and 60s spoke the word with affection. “I’ve always identified as a dyke,” said Tristan Taormino, 51, a feminist author and sex educator. “To me it’s a politicized identity. It’s not just about who I love and have sex with, but my culture, my point of view,. It’s an absolute reclamation.”", "Gay Days, a four-day Pride extravaganza  took on new significance this year.\n Gay Days attracts tens of thousands of LGBTQ visitors each June as well as take part in adult-oriented events, including pool parties, dance nights and drag competitions.\nIt started in 1991, when a smattering of gay adults  used internet message boards to plan a gathering. \nGay Days hasn’t always gone smoothly. In the 1990s, soon after the event was established, some religious groups visitors viewed LGBTQ visitors as a moral affront.  “Don’t Say Gay” bill, which the chief executive denounced.\nBut last weekend, Gay Days participants . Many of them wore red shirts with the words “SAY GAY” on the back, a reference to the recent controversy.", "About 1.6 million people. are transgender, and 43% of them are young adults , according to a new report providing the most recent national estimates of this population.\nrelying on CDC  surveys, estimated that 1.4%  were transgender\nThese new estimates point to a stark generational shift. Young people increasingly have the language and social acceptance to explore their gender identities, experts said, whereas older adults may feel more constrained. ", "More than a half-century after the landmark uprising at the Stonewall Inn in 1969 helped galvanize the fight for gay rights, the annual Pride March has become an event of unapologetic jubilation. This year, \nThe parade took place signaled that it might reconsider other liberties, including same-sex marriage.\nRevelers on the sidelines and those in the march said that the current state of affairs  required renewed activism to maintain and expand civil rights for people who identify as lesbian, gay, bisexual and transgender.", " Throughout the march, “Pride has always gone back and forth between these two things: It’s a riot or a celebration,” said Cynthia Nixon, the actress and former candidate  who marched behind the group. ", "Pride Marchers ‘Nervous’ After Ruling\nRevelers at the annual  Pride March expressed concern about the of gay .", "Gov. Ron DeSantis of Florida is expected to sign House Bill 1557,  which opponents refer to as the “Don’t Say Gay” bill. \nAll of that has obscured the text of the bill itself, which is complex and is about much more than gay rights. It could have far-reaching implications to LGBTQ issues.\nLanguage in the bill prohibits not only “instruction” around gender identity and sexual orientation, but also “discussion” of these topics. “instruction” could mean eliminating books in the with LGBTQ characters or historical figures. No “discussion” is a broad phrase and could mean that gay shouldn’t talk about  .", "\n", "On Thursday, Justice Ketanji Brown Jackson was sworn in as the nation’s 116th Supreme Court justice, becoming the first Black to serve in that role. She replaced Justice Stephen Breyer, who retired.\n“It has taken 232 years and 115 prior appointments for a Black to be selected ” ", "Gov. Kathy Hochul cruised to a win in her Democratic primary on Tuesday, taking a crucial step toward winning a full term. She easily fended off two spirited primary challengers and cemented her status as the state’s top Democrat less than a year after she unexpectedly took office. The runaway victory by Hochul, the state’s first female governor, sets the stage for what could be a grueling general election contest against Representative Lee Zeldin , a conservative congressional ally of former President Donald Trump’s. Zeldin beat out three fellow Republicans in a gritty race for his party’s nomination.\nWhen the race was called, Hochul had won 67% of the Democratic primary vote. Jumaane Williams, a left-leaning New York City public advocate, had won 20% of the vote, and Representative Thomas Suozzi, a Long Island moderate who ran an aggressively adversarial campaign focused on cutting crime and taxes, had won roughly 13% of the vote. Democratic voters also rewarded Hochul’s handpicked lieutenant governor and running mate, Antonio Delgado (third photo), who ran against Ana María Archila, a progressive activist aligned with Williams.\nIn other primaries across the U.S. on Tuesday, the biggest question was whether Democrats would be successful in guiding Republican voters to choose weak nominees for the general elections. In Illinois, Democrats’ biggest and most sustained investment succeeded, but in Colorado, Republicans chose candidates who didn’t have nominal primary support from across the aisle, setting up several general elections that are expected to be very competitive.", "Former President Donald Trump continued pressuring former Vice President Mike Pence to go along with a plan to unilaterally overturn his election defeat even after he was told it was illegal, according to testimony laid out in extensive detail on Thursday by the House committee investigating \nThe committee showed how Trump’s pressure campaign — aided by a little-known conservative lawyer, John Eastman — led his supporters to storm the Capitol, sending Pence fleeing for his life as rioters demanded his execution.\nAn angry mob with baseball bats and spray chanting “hang Mike Pence” came within 40 feet of the vice president. Pence’s Secret Service detail had to hustle him to safety and hold him for nearly five hours in the bowels of the Capitol.\nIn the third public hearing this month to lay out its findings, the panel recounted how Trump’s actions brought the nation to the brink of a constitutional crisis, and raised fresh questions about ", "Bill Barr, the former attorney general, testified that he believed former President Donald Trump had grown delusional as he insisted on pushing false claims of widespread election fraud that he had been told repeatedly were groundless\n“He’s become detached from reality if he really believes this stuff,” Barr told the panel, adding, “There was never an indication of interest in what the actual facts were.”\nIn a hearing focused on the origins and spread of Trump’s lie of a stolen election, the panel played excerpts from Barr’s testimony, as well as from a chorus of campaign aides and administration officials who recounted how his claims of election irregularities were bogus.", "Prime Minister Boris Johnson survived a dramatic no-confidence vote in Britain. The too-close-for-comfort result leaves him badly wounded and sets off a volatile period in British politics as he stay in power and fend off potential challengers in his Conservative Party.\nThe vote, 211 to 148, fell short of the simple majority of Tory lawmakers needed to oust Johnson as party leader. But it laid bare how badly his support had hemorrhaged since last year, when a scandal erupted over reports that he and his aides had thrown parties at 10 Downing Street that violated the government’s lockdown rules.\nJohnson vowed to stay on, arguing before the vote that it should put an end. In an address to party members as they prepared to cast their ballots, he urged them to avoid a “pointless fratricidal debate about the party.’’\nIn less than three years, Johnson has gone from being Britain’s most reliable vote-getter — a celebrity politician who redrew the country’s political map — to becoming a scandal-scarred figure. His job has been in peril since the first reports of illicit parties emerged last November.", "Former President Barack Obama returned  to celebrate a new policy that expands coverage under the Affordable Care Act, his signature domestic policy achievement.\nIt was the first visit Obama had made since departing in January 2017.\nBut first, a buddy comedy act we’ve seen somewhere before. “Vice President Biden,” Obama said smoothly in the East Room, an introduction he insisted was a joke. It was then up to President Biden, who had served as Obama’s vice president, to show off the other role he had held under Obama for eight years: comedic foil. “Mr. President, welcome back to the White House, man,” he said. “Feels like the good old days.”\nThe visit gave Obama and Biden a moment or two to engage in the sort of light ribbing that appeared downright quaint by current Washington standards. Instead, the moment was the briefest of diversions from the domestic and foreign policy quagmires surrounding the Biden White House. And no one seemed to appreciate that respite more than Biden, whose approval numbers are lagging.", "Jeff Zucker resigned on Wednesday as the president of CNN and the chairman of WarnerMedia’s news , writing in a memo that he had failed to disclose to the company a romantic relationship with another senior executive at CNN.\nZucker, 56, is among the most powerful leaders in the media and television industries. The abrupt end of his nine-year tenure immediately throws into flux the direction of CNN and its parent company, WarnerMedia, which is expected to be acquired later this year by Discovery Inc. in one of the nation’s largest media mergers.\nIn a memo to colleagues that was obtained by The New York Times, Zucker wrote that his relationship came up during a network investigation into the conduct of Chris Cuomo, the CNN anchor who was fired in December over his involvement in the political affairs of his brother, former Gov. Andrew Cuomo of New York.", "When Angela Merkel became chancellor 16 years ago, George W. Bush was in the White House and Tony Blair was prime minister of Britain. There was no Twitter and no iPhone. Liberal democracy was in seemingly irreversible expansion, with the Orange Revolution .\nOn Wednesday, as Olaf Scholz, Merkel’s successor, takes over as chancellor, Twitter is a veritable tool of diplomacy\nIn the intervening years, Merkel has stood up to Vladimir Putin. She bonded with Presidents George W. Bush and Barack Obama and scolded President Donald Trump. She became an icon of hope for refugees and an object of scorn for populists the world over.\nNow, her long political life appears to be coming to a close. Merkel, 67, was always clear that she wanted to leave office on her own terms and in her own time. “I want at some point to find the right time to quit politics,” she told Herlinde Koelbl, a German photographer, in 1998. “I don’t want to be a half-dead wreck.”", "Prince Philip, the Duke of Edinburgh, husband of Queen Elizabeth II, father of Prince Charles and patriarch of a turbulent royal that he sought to ensure would not be Britain’s last, died on Friday at Windsor Castle in England. He was 99.\nPhilip had been hospitalized several times in recent years for various ailments The queen and Prince Philip  Philip tried to shepherd into the 20th century a monarchy encrusted with the trappings of the 19th. But as pageantry was upstaged by scandal, as regal weddings were followed by sensational divorces, his mission, as he saw it, changed. It was to help preserve the crown itself.\nPhilip occupied a peculiar place on the world stage as the husband of a queen whose powers were largely ceremonial. He was essentially a second-fiddle figurehead, accompanying her on royal visits and sometimes standing in for her.\nAnd yet he embraced his royal role as a job to be done. “We have got to make this monarchy thing work,” he was reported to have said.", "an Andrew Yang make it in politics?\nYang, who dropped out of the presidential race in February, has name recognition, fund-raising ability and some different ideas on how to run a government. \nFor much of his career — he has a mixed record of success in the nonprofit and start-up worlds — \nYang is still every bit the unorthodox contender, and that approach offers him both opportunities and monumental challenges in the race to lead New York out. His candidacy — which may be officially announced as early as this week — would offer a clear test of whether New Yorkers want a splashy but inexperienced contender with bold ideas for navigating the city’s recovery, or whether a mood of citywide propels a more familiar local figure with a traditional governing background. ", "The Queen has arrived in Edinburgh with members of her family for the start of a week of royal events in Scotland.\nShe was joined by her youngest son, Prince Edward, and his wife, Sophie, for a traditional ceremony opening the Royal  Ceremony of the Keys on the forecourt of the Palace of Holyroodhouse's Holyrood week.\nThe 96-year-old has mobility issues and the decision to travel to Edinburgh was only confirmed this morning.\nShe has cut back on engagements recently and was last seen in public during the Platinum Jubilee.", "North Korean president Kim Jong-un has attended the funeral of a top military official not wearing a mask, \nState-run television has shown the funeral ceremony with the North Korean leader carrying the coffin of Hyon Chol Hae.\n North Korea has advised people to always wear a mask, and in some cases, two.", "Italian Prime Minister Mario Draghi called for the EU integration process to be sped up in order to better tackle crises during today's This is Europe debate in Strasbourg.", "how dangerous it can be for journalists to keep us informed and defend press freedom. Find out what the European Parliament is doing to protect journalists and their work \nParliament's late president David Sassoli was a public servant, not just as an elected official but as a journalist.\nTo honour his work and memory, Parliament is launching a new training programme and scholarship scheme for journalists. It will bear his name and reiterate Parliament's unwavering commitment to supporting pluralist, independent and free media as an essential part of a democratic society.\n\"Protecting and supporting journalists is in the vital interest of democratic societies,\" Sassoli said in 2021, speaking at the award ceremony for the Daphne Caruana Galizia Prize for Journalism.\n\"What makes us a model is not moral perfection. It is the fact that we have rules and mechanisms that allow us to control those in power, reveal wrongdoings and strive to be better, and one of the most powerful such mechanism is independent and critical journalism.\"", "Jubilant supporters have celebrated Emmanuel Macron’s election win at the foot of the Eiffel Tower.\nHe has won five more years as France's president after a convincing victory over rival Marine Le Pen, who nevertheless secured the far right's highest share of the vote yet.\nThe centrist leader won by 58.55% to 41.45%, a great er margin than expected.\nHe is the first sitting president in 20 years to be re-elected and told supporters he would be a \"president for all\".\nDespite her loss, Ms Le Pen said her significant vote share still marked a victory.", "The young photographer (@a_blind_photographer) describes her work as “very ironic”, as she cannot see the details in her own photography. Roesie, however, looks for shapes and focuses on bold colours in her work.\nRoesie writes (of image one): “As a photographer, I believe that if you want to get that perfect shot, you need to do things that most people wouldn’t even think of doing. So I put my wellies on so I could get into the water to photograph those unique moments instead of seeing the obvious pictures.”\nSwipe to see more of Roesie’s work", "Divided, distracted and desperate to play golf!\nSimon Wilde reveals in the inside story of Ashes humiliation. ", "It’s nearly time. The Ashes are nearly upon us and as we look forward to another classic contest, Marc Aspland looks back at a famous test in 2010  draw at The Gabba. Click the link to see his special gallery of unique photos.", "One. More. Race. Lewis Hamilton celebrates winning the Saudi Arabia Grand Prix, beating Max Verstappen to set up a winner takes all final race next weekend in Abu Dhabi.", "She did it! Emma Raducanu is US Open champion! Stuart Fraser is in to witness one of the most astonishing stories in sport get a fairytale ending", "From Sky Brown to Katarina Johnson-Thompson there’s been both joy and heartbreak for Team GB in Tokyo. Keep up to date with all the latest action and analysis", "He’s back! Manchester United have confirmed that Cristiano Ronaldo is on his way back to the club in one of the most astonishing transfers of the summer. ", "t was a great end to the first full week of the Olympics as Max Whitlock and Charlotte Worthington both won gold. ", "You wait all weekend for an Olympic Gold and then three come along at once!\nCongratulations to Adam Peaty, Tom Daley, Matty Lee and Tom Pidcock as they triumphed in Tokyo. ", "After the delays and doubts the Tokyo Olympics are finally here. ", "Congratulations to our photographer Bradley Ormesher who has been named Sports Photographer of the Year at the 2020 Press Awards, winning for these three stunning images. Every week Brad and Marc Aspland present their Unseen gallery online so keep an eye out!", "Heartbroken. Raheem Sterling consoles Jordan Pickford after lost the Euro 2020 final on penalties. Pickford saved two but it wasn’t enough. ", "What. A. Game. Delight for Italy as they reach the final of Euro 2020. Despair for Spain as they lose on penalties. Click the link in our bio to read Matt Dickinson’s report on a thrilling game.", "Hands up who’s in the final of Euro 2020! Harry Kane scored the winner to set up a Wembley clash with Italy on Sunday. ", "Manchester City will aim to win their first Champions League trophy this weekend. After claiming the Premier League title earlier this month, Paul Hirst and Pol Ballus wrote about the changes Pep Guardiola has made at the club this season. ", "“It is my first world-class race and these are feman I’ve literally grown up watching” - sprinter Sha’Carri Richardson tells Matt Lawton about preparing to face Dina Asher-Smith and her hopes for Olympic glory. ", "During #euro2020 you can listen to daily shows from The Game podcast with insight and analysis from our pundits . In our final preview show Jose Mourinho joined the team to pick out some of the potential stats for the tournament. ", "Ready to fly: In 2018 Katie Ormerod broke her heel and in turn shattered her Olympic dream. She tells Rebecca Myers why she’s ready to make up for lost time as she prepares for Beijing 2022. ", "It was a thrilling battle but produced an excellent display to narrowly beat France in the Six Nations. ", "oe Root was back to his authoritative best in ’s first test against Sri Lanka, reaching his century ", "\nAdam Peaty is already the 100m breaststroke world record holder but he tells Matt Dickinson he’s not finished making swimming history. ", "Outrageous, rebellious, fearless - he lived football’s most epic life’\nMatt Dickinson pays tribute to Diego Maradona. ", "Times sport photographers @marc.aspland & @bradley.ormesher are at @wimbledon catching the highs, lows and everything inbetween. ", "Victory parade in Boston after New England Patriots win the LIII Super Bowl", "To coincide with the #6nations rugby we are posting Times photographer Marc Aspland's favourite pictures of the tournament from over the years, full gallery in app and on site now.", "", "Catherine Russell, @atayesheunfpa call for an immediate cessation of all attacks in #Ukraine.\nThe horrific attacks in 🇺🇦 are killing & causing serious injuries  , destroying  infrastructure .\nTo attack the most vulnerable is an act of unconscionable cruelty.\nSince the start of the war, . In 24 incidents  facilities were damaged or destroyed, while in 5 cases ambulances were damaged or destroyed. These attacks have led to at least 12 deaths & 34 injuries, \nThe  system in 🇺🇦 is clearly under significant strain, & its collapse would be a catastrophe. Every effort must be made to prevent this from happening.\nHumanitarian partners workers must be able to safely maintain & strengthen essential service delivery, incl. \nIt is critical that humanitarian actors have safe & unimpeded access to reach ALL civilians in need wherever they may be.\n@unicef, @unfpa & WHO are working with partners to scale up life-saving services & support to meet urgent needs.\nservices should be protected from all acts of violence & obstruction. For the sake of workers, & for all people in Ukraine who need access to the lifesaving services they provide, attacks on all other civilian infrastructure must stop.\nFinally, we call for an immediate ceasefire, which includes unhindered access so that people in need can access humanitarian assistance. A peaceful resolution to end the war in Ukraine is possible.", "Accidents are common in Ukraine’s aging coal mines. Methane gas, a byproduct of coal mining, is highly explosive. In 2007, a methane blast killed more than 100 miners. Now, Russia’s heavy, indiscriminate bombing has added yet another threat to Ukraine’s coal mines, where personal fears and global anxieties meet.\nUkraine relies on coal for its industrial iron and steel sectors. Coal-fueled thermal power plants generate about one-third of the country’s electricity. For its supply of coal, Ukraine has relied on imports, mostly from Russia, but that supply has been cut by the war, so continuing to mine the domestic supply has become essential for survival.", "Video Shows Missile Striking Ukrainian Mall\nSurveillance footage shared by President Volodymyr Zelensky of Ukraine showed the moment a Russian missile struck a shopping mall in the city of Kremenchuk.  the death toll rose to at least 18 people, with more injured and many unaccounted for.", " energy embargo on Russia — to end the fighting in Ukraine .\nlike Dominika Lasota and her comrade, Wiktoria Jedroszkowiak, both 20, have emerged as leaders in a dynamic new wing of the antiwar movement. They say the only solution to the war in Ukraine and that until then, more Ukrainians will needlessly die.\nLviv, a city in Ukraine’s relatively safe west, is largely untouched by the war physically, but death reaches here anyway. Residents bury the bodies of soldiers killed fighting in battlefields farther east. Displaced families that fled Russian forces must inter their loved ones here, far from home.\nThe task of interring the dead has fallen to gravediggers, embalmers, funeral directors and coroners. These workers carry deep psychic wounds of war — and there are few who can relate to them.\n“Nowadays, I feel numb,” said Antoniy, a morgue worker in Lviv. “Even when someone is telling me a joke that I know is funny, I can’t laugh. My emotions are too numbed.”\nA senior adviser to Ukraine’s president recently estimated that about 100 to 200 Ukrainian soldiers were dying each day, an increase from just a few weeks earlier, when President Volodymyr Zelensky said 60 to 100 were killed daily.\n“We used to do one or two funerals a month. Now, we’re short-handed,” said Mikhailo, a gravedigger who buries many of the dead that Antoniy prepares for burial. ”", "A mass grave on the edge of Lysychansk, in eastern Ukraine, remains uncovered. The dead are civilians who were killed by shelling in recent months in the embattled twin cities of Lysychansk and Sievierodonetsk and the nearby town of Rubizhne. \nStanding above the grave, Pvt. Sergiy Veklenko, 41, explained why the bodies were still exposed: “All of our machinery that we had in the city’s inventory — excavators and all — was given to the army for digging trenches.”\nAs the war grinds into its fourth month and Ukrainian and Russian casualties mount well into the thousands of dead, it is clear that the trenches also have become graves for many soldiers.\nPrivate Veklenko, a former police officer who joined the Ukrainian army when the war began, estimates that 300 people are buried in the mass grave. “We’ve been burying people here who died since April,” he said.\nAs Russia solidifies control in Sievierodonetsk and shifts its focus to neighboring Lysychansk, civilian casualties there are sure to mount, unless Ukrainian forces retreat. Lysychansk, an industrial city with a prewar population of 100,000, is largely cut off from the outside world, with no cellphone service or electricity. Local officials estimate that 40,000 people remain in the city.", "The leaders of France, Germany and Italy met with President Volodymyr Zelensky of Ukraine on Thursday in their first such show of support for him since Russia’s invasion began in February. The visit comes as questions mount over European backing for Ukraine and as Zelensky calls for heavier weapons to offset Moscow’s artillery advantage.\nPresident Emmanuel Macron of France, Chancellor Olaf Scholz of Germany and Prime Minister Mario Draghi of Italy follow a host of European leaders who have traveled overland to the capital, Kyiv, with air travel off limits because of security concerns.\nThe European leaders also traveled to Irpin, a Kyiv suburb where investigators are looking into reports of Russian atrocities during the war. Scholz lamented the destruction that the war is causing, and said from Irpin, “It is even worse when you see how terribly senseless the violence is that we are seeing here.”\nRussia dismissed their visit as empty symbolism. Dmitri Medvedev, the former Russian president who is vice chairman of President Vladimir Putin’s Security Council, on Thursday disparaged the French, German and Italian leaders as “European connoisseurs of frogs, liverwurst and pasta.”", "Ukraine’s desperate struggle to hold on to its territory in the eastern Donbas region reached a critical point . Ukrainian and Russian soldiers clashed in street battles in the city of Sievierodonetsk, and the last bridge linking the city with Ukrainian-controlled territory to the west was destroyed.\nAfter weeks of intense fighting, Russia appeared closer than ever to claiming Sievierodonetsk, potentially handing President Vladimir Putin  he can present to the Russian people. It could also help bring him a step closer to taking complete control of the strategically important Donbas region, his primary military goal after his forces failed to seize the Ukrainian capital, Kyiv, and other big cities.\nSince the start of the Russian invasion of Ukraine, have been documenting the war and following the flow of refugees across Europe. ", "Russia’s brutal invasion of Ukraine has jolted Taiwan into confronting the prospect of a sudden attack from the island’s own larger and more powerful neighbor: China.\nChina’s leader, Xi Jinping, has long laid claim to self-governed Taiwan — much as President Vladimir Putin of Russia did with Ukraine. Taiwanese Army reservists are training harder than they ever have before, running military drills in their airspace and simulating attacks on buildings.\nThe war in Ukraine has been a lesson in the tactics and weaponry that could slow a more powerful invading force. A growing number of Taiwanese people have been making their own preparations so they will not be defenseless in the event of war. “Ukraine showed us that you need to first show to others that you have the resolve to defend yourself; only then will others come and help,” said Wu Chiuan-syun, a computer engineer in Taipei.\n civilians participated in battle simulations during a combat medic training workshop near Taipei and, in Hsinchu, rescue workers took part in exercises simulating buildings and public transportation being attacked by Chinese missiles.", "In a nation at war, and a city aching for some semblance of normalcy, the Odesa Opera reopened  for the first time since the start of the Russian invasion. The performances began with an impassioned rendition of the Ukrainian national anthem. The 1810 theater, protected by piles of sandbags, was about a third full as a result of security restrictions.\n At the start of the war the explosions and sirens terrified me, as if I had plunged into some unreality, a World War II movie, but humans get used to everything. \nOdesa has been generally quiet in the past few weeks, but just 70 miles to the east — in the port city of Mykolaiv — Russian shelling continues daily.\n"]