["Confession time! Ex Love Islander Curtis Pritchard tells all about his time in the villa - and why he would NOT take part in the ITV2 show ever again. The 26-year-old professional dancer came fourth in the fifth series of the show back in 2019, alongside ex-girlfriend Maura Higgins. Despite giving him a huge platform to go on and do other things, the reality star wouldn't be keen on stepping foot inside the villa for a second time. In an exclusive chat with The Sun, Curtis says: \"Would I do it again? Probably not, because I want to move on to hosting.\" After his stint on the hit programme, Curtis has gone on to land a number of roles on a variety of shows - including Ru Paul's Drag Race and Hollyoaks. What would you want to see Curtis take on next? Let us know in the comments below! 📸: The Mega Agency #CelebrityNews #LoveIsland #CurtisPritchard", "Carl wants babies with Katie after she swerved jail. Read the full story on http://thesun.co.uk, using the link in our stories.", "Millions of workers are set for a pay rise of as much as £330 within days when a change to taxes comes in. The government is raising the amount you can earn before you start paying National Insurance contributions to £12,570. This is an increase from £9,500 and you should see the change in your first pay check from July 6. The change will save the average worker £330 a year, depending on how much you earn. Are you excited for the pay rise? 📸: Getty. #NationalInsurance #Payrise", "Paige’s family have called Jacques ‘hell’ after explosive row. Read the full story on http://thesun.co.uk, using the link in our stories. #LoveIsland", "The Only Way is Essex bosses have held top secret talks with a fan favourite original cast member to make a dramatic return to the series. Execs from the ITVBe reality show are keen to get series legend Lauren Goodger to make an epic comeback to spice up future episodes. The 35-year-old was with Towie from its first season in 2010 until its sixth season in 2012 - with a brief comeback in 2019. A source revealed that: “Producers have reached out to Lauren as they would love to have her back - She is one of the most popular originals and now she is about to become a mum for the second time, they feel this is the perfect time to reintroduce her to viewers.\" Would you like to see Lauren return to the next season of Towie? 📸: ITV #LaurenGoodger #TOWIE", "Former Islander Chris Hughes have Gemma Owen advice before she headed into the villa. Read the full story on http://thesun.co.uk, using the link in our stories. #loveisland #chrishughes #gemmaowen", "Dame Deborah James has died aged just 40. The mum-of-two, known to her millions of followers and fans as BowelBabe, was diagnosed with stage four bowel cancer just days before Christmas 2016, at the young age of 35. Deborah’s death was announced on Instagram this evening, with the caption reading: “We are deeply saddened to announce the death of Dame Deborah James; the most amazing wife, daughter, sister, mummy. Deborah passed away peacefully today, surrounded by her family.\" Dame Deborah has left behind an incredible legacy after dedicating much of her time raising awareness for bowel cancer and its symptoms. Debs, you will be sorely missed. Join us below in sending our condolences to her family and loved ones. 📸: TheSun #DameDeborahJames #BowelBabe #DeborahJames", "Kim Kardashian has received an outpouring of praise for showing off her natural bikini body in pics that resurfaced over the weekend. The 41-year-old reality queen displayed her stunning figure – cellulite and all – in the snaps taken at a Mexico beach back in 2017. Kim looks incredible walking down the beach in a printed bikini. One fan writes: “This is how anybody looks unedited. Cellultie is so normal, whatever size you’re at, and it shows depending on lighting.” Another adds: “She has cellulite and body bumps like every other woman. She just looks human.” We love these pics of Kim – it’s refreshing to see natural beauty and we want to see more. Let us know what you think. 📸: Splash  #KimKardashian #CelebPics #Kardashians", "🚨Warning alert!🚨 Brits are being cautioned to avoid an easy passport mistake that means you could be denied boarding. Modina Shokeye takes to TikTok to let others know about her error in an effort to save anybody else the heartache. She was turned away from her Ryanair flight to Ibiza after incorrectly counting how many months her passport had left. After scrambling to get an emergency passport - her bid was denied, meaning she couldn’t fly out while the rest of her friends partied it up in Ibiza. Modina says: “My passport expires August 14 and my holiday was June 9 to June 14, so by the time I came back I’d still have three months left on my passport - or so I thought.” Don’t get caught out by the same mistake! :camera_with_flash:: Getty #Travel #TravelNews #PassportWarning", "Love Island's Faye has got her own back on a cruel troll who sent her 'horrendous messages'. The 27-year-old told fans how she took her revenge as she warned people not to mess with her. The star, who appeared on the show last year, revealed she sent screenshots of the messages to the boy's mum, rugby club and his employer after being so horrified by what he had said. She went on to reveal that the lad’s mum had blocked her, but unbothered, she added: “Hope he gets sent to bed with no tea tonight and he gets his PlayStation taken off him.” No-one deserves to be trolled. Join us in the comments to send your support to Faye. 📸: @faye__winter #LoveIsland #CruelTrolls #ITV2", "Two days after the Supreme Court overturned Roe v. Wade, a 27-year-old woman delivered her fourth child. The woman, who asked to be identified by her first initial, T., had fled domestic abuse and been denied an abortion. Her son is among the first of many babies expected in a post-Roe Texas. \n\nOne in 10 people of reproductive age in America live in Texas, which will soon outlaw almost all abortions. The state is one of the most dangerous in the nation to have a baby, with high maternal and infant mortality rates. Texas’ conservative leadership has spent decades restricting abortion access while cutting social spending and publicly funded health care. Now, even some anti-abortion advocates say their state is woefully unprepared for a likely surge in births among poor women.\n\nSome anti-abortion crisis pregnancy centers have come under scrutiny for misleading or misinforming women seeking abortion care. “We do want to limit abortions,” said Aubrey Schlackman, the founder of Blue Haven Ranch, a Christian nonprofit that is providing housing and other assistance for T.’s family. “But we personally weren’t ready to handle an influx, and I know so many of the other nonprofits that we work with aren’t ready for that, either.” Schlackman accompanied T. to a birthing center to provide support when she went into labor, and Blue Haven supporters purchased everything on T.’s baby registry. The nonprofit will offer assistance for at least another year.\n\nT. has a message for Texas legislators: “You don’t know what is best for any family. You didn’t protect me or my kids. I protect my kids. Only a mom can know what is best for herself and her family. And if you’re going to force women to have all of these babies that they are not equipped to have, then you need to provide support for women and their children after the babies are born.”\n\nTap the link in our bio for a deeper look into the post-Roe landscape that expecting mothers must navigate. Photos by @erinschaff", "A strawberry galette served with a side of fresh whipped cream or ice cream is a spring salve that is just as soothing to prepare for oneself as it is to share with others. The dough in this recipe includes almond flour, making for a flaky, subtly nutty crust that comes together easily. \n\nTap the link in our bio to get @bottomofthepot's recipe from @nytcooking. Photo by @chrisrsimpson, with food styling by @francesboswell", "Eduardo Franco, who joined the Netflix show “Stranger Things” this season, has carved out a role as the show’s stoned comic relief during its most horrifying season. His character, an affable pizza delivery man named Argyle, has quickly become a fan favorite. He transcends the stoner-pal stereotype and adds a little heart to the story in the form of his sweet friendship with Jonathan Byers. “I loved that I could hopefully bring a breath of fresh air to the chaos that ensues in the show,” Franco said.\n\nFinn Wolfhard, who plays Mike Wheeler in “Stranger Things,” saw Franco in the movie “Booksmart” and suggested him for the role. Franco’s personality shines through in his character— he is similarly funny and informal, indulging in f-bombs as freely as Argyle does his marijuana habit. “It was so fun sitting there, marinating in the awkwardness,” he said. \n\nTap the link in our bio to read more from our interview with @dumbuardo. Photo by @ryanlowry", "Brittney Griner's Trial Begins in Moscow\n\nThe American basketball star Brittney Griner went on trial in Russia on Friday, in a case that supporters say has turned one of basketball’s most decorated players into a wartime hostage of the Kremlin. A representative from the U.S. Embassy in Moscow said that Griner was “in good spirits and is keeping up the faith.”\n\nTap the link in our bio for live updates.", "At least 21 people were killed and dozens were injured when Russian missiles struck a residential tower and a recreational center in a coastal town southwest of the Black Sea port of Odesa early Friday, Ukrainian officials said.\n\nOne of the missiles hit a nine-story residential tower in Serhiivka, about 50 miles southwest of Odesa, killing 16 and injuring at least 38, according to Ukraine’s state emergency service. Another hit a recreational center, where five died and one was injured, emergency officials said  on Telegram.\n\nRescuers completed the search for bodies at the tower, which was home to more than 100 people and which was destroyed on one side, according to the regional military administration. They were still going through the rubble of the recreational center, officials said.\n\nTap the link in our bio for live updates on the war in Ukraine from our journalists on the ground.", "The fall of Roe v. Wade has pushed the U.S. into turbulence that feels all too familiar to those who lived through the pre-Roe era. We spoke to women who remember a time without Roe — and the early years after the 1973 ruling.\n\nCatherine Starr told The New York Times in an interview that she had become pregnant when she was 16, and, without the option of a safe, legal abortion, she gave her baby up for adoption. She was 17 when she attended her first demonstration to push for abortion rights outside City Hall in St. Louis. It was May 24, 1973, just months after the Supreme Court ruled on Roe v. Wade. Starr went to the rally because she “wanted to be able to make sure that the next little girl that gets pregnant has an option,” she said.\n\nThe same year that Roe was decided, our photographer William E. Sauro documented scenes inside Women's Medical Services (second and fourth photo), an abortion clinic on Walnut Street in downtown Philadelphia, and our photographer Librado Romero took pictures of  workers inside the Women’s National Abortion Action Coalition office in New York (third photo).\n\nIn 1981, our photographer John Sotomayor captured abortion rights activists dancing at a demonstration at Liberty and Church Streets in Manhattan to commemorate the eighth anniversary of the Supreme Court’s decision.\n\nTap the link in our bio to read more about the women who were on the front lines of the abortion rights movement before Roe was the law and shortly after the ruling. Photos by John Sotomayor/The New York Times, William E. Sauro/The New York Times and Librado Romero/The New York Times #roevwade #abortion #nytarchives", "It’s been 25 years since Hong Kong was handed over to China. The only constant has been change, both defined and defied by the people of Queen’s Road, Hong Kong’s most storied avenue. All around them, a city has been transformed — not only by the dizzying economic expansion of mainland China, threatening to make this international entrepôt unnecessary, but also by the crushing of freedoms by Hong Kong’s current rulers, who have filled jails with young political prisoners.\n\nWithout evidence, pro-Beijing politicians have accused those who joined protests of colluding with the CIA. The fearsome security law has led unions and newspapers to shutter for fear that workers will receive lifetime prison sentences. Nearly 50 politicians and democracy activists have been imprisoned under the new rules. \n\nToday, there are no mass protests on Queen’s Road or anywhere else in Hong Kong.\n\nHong Kong has been split between those who supported the protesters and those who worried that Hong Kong’s business-friendly reputation was being destroyed. \n\nFor complete coverage of Hong Kong’s Handover Anniversary, go to the link in our bio. Photos and video by @sergeyponomarev", "A new season of “Gayflower” boat parties kicked off a new season this month with a Spice Girls-themed event.\n\nSince the parties’ inception, each has been a tribute to a different pop music act, celebrated through music and dress. Revelers, who are mostly gay men, often show up in outfits inspired by the artist being honored. \n\nWhether dressed as the Spice Girls or not, many of the 500 attendees of this season’s inaugural event were drawn to the event by a sense of nostalgia and a desire to celebrate “girl power,” a rallying cry of the group. \n\nThe brainchild of D.J. Ty Sunderland, the Gayflower boat party series began in 2018 and was named after the Mayflower ship that ferried the pilgrims from England to Plymouth, Massachusetts, in 1620. Even Those who have not attended one of the parties may be familiar with them because of the 2021 event honoring Britney Spears, after which an incident involving an unruly partygoer unexpectedly spread across social media.\n\n“There was a DEMON twink on Britney boat last night,” Sunderland wrote on Twitter the day after the party, using a term referring to gay men with thin, hairless bodies who are typically young. The incident prompted a cascade of tweets and even a mention this month on the talk show “Zine.”\n\nTap the link in our bio to read more from chbarnard about the “Gayflower” parties and to see more photos from this year’s inaugural event. Photos by @jone_bone", "Taika Waititi has a lot on his plate. While editing Marvel’s “Thor: Love and Thunder,” the writer, actor and Oscar-winning director spent occasional weekends playing a pirate in the HBO Max comedy series “Our Flag Means Death.” He is editing a soccer comedy-drama, writing a new “Star Wars” movie, working on an Apple TV+ series and preparing two Roald Dahl projects for Netflix — among other things. In just a few years, he has become one of the industry’s most ingenious and reliable purveyors of escapist fare.\n\nWaititi’s runaway résumé is also a sign of how difficult he finds it to say no. “But then the thing comes out, you see where the hard work goes and it’s really worth it,” he said in an interview with The New York Times.\n\n“I know there’s too many things,” he added. “I know I’m doing a lot. I just have to keep pivoting every couple of hours.”\n\nIn the new “Thor,” Waititi wanted the superhero to experience love with a partner. The story line provided the opportunity to bring back Natalie Portman, who played Thor’s love interest in the first two films. Waititi’s work has impressed Portman over the years, she said, adding that he is “able to blend the silly and the profound, all with a distinctive visual style.”\n\nTap the link in our bio to read our interview with @taikawaititi. Photo by @danascruggs", "On Thursday, Justice Ketanji Brown Jackson was sworn in as the nation’s 116th Supreme Court justice, becoming the first Black woman to serve in that role. She replaced Justice Stephen Breyer, who retired.\n\n“It has taken 232 years and 115 prior appointments for a Black woman to be selected to serve on the Supreme Court of the United States,” Justice Jackson said in April at a White House celebration after her confirmation. “But we’ve made it. We’ve made it. All of us.”\n\nTap the link in our bio to read more about Justice Jackson.", "A Florida law banning abortions after 15 weeks of pregnancy violates privacy protections in the State Constitution, a state judge ruled on Thursday, a day before the new restrictions were to take effect.\n\nJudge John Cooper of the Second Judicial Circuit Court in Tallahassee ruled from the bench that the law, signed by Gov. Ron DeSantis in April, will not be enforced for now. Florida currently allows abortions until 24 weeks, making the state a refuge for women seeking the procedure from across Southeastern states with tighter restrictions.\n\nJudge Cooper said he would issue a temporary statewide injunction. It will not be binding until he signs a written order, something the judge said would not happen on Thursday. The ban takes effect at midnight.\n\nThe state is expected to appeal Judge Cooper’s ruling. The issue will most likely end up before the Florida Supreme Court, which in the past has cited a privacy amendment that voters wrote into the State Constitution in 1980 to block other abortion restrictions from taking effect. But DeSantis has reshaped the court following several retirements and made it much more conservative. He appointed three of the court’s seven justices. The other four justices were also appointed by Republican governors.\n\nThis is a developing story. Read the latest at the link in our bio.", "Illinois may stand alone as an island of abortion access for a swath of the Midwest and the South as neighboring states have banned, or are moving to ban, the procedure. \n\nFour of Illinois’s neighbors immediately banned abortion after the Supreme Court’s decision on Friday, and two others — Ohio and Tennessee — now restrict the procedure to no more than six weeks into a pregnancy. \n\nThere are 29 abortion providers in Illinois, but as clinics in surrounding states stop providing abortions or close altogether, these providers say they may not be able to meet the demand.\n\nTap the link in our bio to read more about how the overturning of Roe v. Wade might affect abortion access in Illinois.", "🎶 Adele at BST Hyde Park review⁠\n⁠\n★★★★☆⁠\n⁠\nFinally it was here, the first UK concert proper since 2016 by the country’s favourite singer.⁠\n⁠\nAdele did do a show at the London Palladium in November, but that was before an invited audience of celebrity guests, and after cancelling her entire run of Las Vegas shows at the last minute earlier this year our girl from Tottenham needed to prove she hadn’t gone totally Hollywood.⁠\n⁠\nThis was her chance to remind an audience of fans, who had shelled out a lot of money for tickets, why she became such a relatable phenomenon in the first place.⁠\n⁠\nAdele emerged on a warm summer night to Hello, extremely glamorous in pearl earrings and a black dress, her voice entirely capable of blasting it out to the back of the park, stopping halfway to shout out: “I’m so happy to be here!”⁠\n⁠\n🔗 Follow the link in bio for the full review⁠\n⁠\n📸 Gareth Cattermole/Getty Images", "Boris Johnson bowed to pressure to suspend a former Tory minister accused of drunkenly groping two men as a fresh claim emerged about his behaviour.⁠\n⁠\nChris Pincher, who resigned as the deputy chief whip on Thursday, will face an investigation by a parliament watchdog after one of the men made a formal allegation.⁠\n⁠\nThe prime minister was alerted to the complaint by a Conservative MP who said he had witnessed the incident and was in contact with the alleged victim.⁠\n⁠\nDowning Street sources said that having heard the first-hand account, Johnson immediately moved to suspend the whip from Pincher pending the outcome of the investigation.⁠\n⁠\nThey defended Johnson’s failure to act earlier, saying that the prime minister had wanted to follow “due process”.⁠\n⁠\n🔗 Click the link in our bio for the full story⁠\n⁠\n🖋️ Peter Brookes", "🐙 Population of rare octopus booms on south coast 🐙⁠\n⁠\nBritain is experiencing a surge in octopuses after the last boom more than 70 years ago.⁠\n⁠\nDivers and snorkellers have reported an increase of common octopus (Octopus vulgaris) around the Lizard in Cornwall, which despite its name is rarely seen in UK waters and has been recorded twice a year on average.⁠\n⁠\nMatt Slater, of Cornwall Wildlife Trust, said: “I got really excited when I started receiving messages from our divers — not only because sightings are few and far between but because they’d seen several on one dive⁠\n⁠\n🔗 Click the link in our bio to read the full story", "Few moments of emotion on Centre Court will be beaten by Katie Boulter’s dedication of yesterday’s victory to her grandmother, who died two days earlier.⁠\n⁠\nSpectators’ joy at the British wildcard’s victory over last year’s finalist, Karolina Pliskova, switched to tears as she announced the death of her most loyal supporter while being interviewed on the side of the court.⁠\n⁠\n“I’m probably going to get emotional,” she said as the 15,000-capacity crowd fell silent. “My grandmother died two days ago, so I’d like to dedicate that to her today. It’s a dream come true for me and if I can have you behind me for those, I can probably go a long way.”⁠\n⁠\n➡️ Swipe to learn more about the British Wimbledon wildcard⁠\n⁠\n🔗 Link in our bio for the full story", "Babies will be banned from the Commons after MPs complained that it would be a distraction and parliament would not be “taken seriously” if young children were allowed.⁠\n⁠\nThe procedure committee, a cross-party body which oversees the Commons, has recommended that members should not bring babies into the Commons or committees.⁠\n⁠\nIt was ordered to carry out a review last year after Stella Creasy, the Labour MP for Walthamstow, was rebuked by Commons authorities for bringing her son Pip, then three months old, with her to debates.⁠\n⁠\n🔗 Link in our bio for the full story", "The disgraced singer R Kelly was given a 30-year sentence for grooming and sexually exploiting women and girls.\n\nA jury at Brooklyn federal court found the 55-year-old guilty of racketeering and eight charges of sex trafficking linked to his decades of entrapping aspiring singers and others for sex. “His actions were brazen, manipulative, controlling and coercive. He has shown no remorse or respect for the law,” prosecutors wrote.\n\nBorn Robert Sylvester Kelly, he sold more than 75 million records but used the fame and money earned through songs such as Ignition and I Believe I Can Fly to lure children and young women into his homes.\n\nHis staff helped him to commit and cover up crimes for almost 30 years, even though there have been public allegations against him since the Nineties and his lyrics hinted at the abuse.", "Boris Johnson and other world leaders visited the Prado Museum during the Nato summit in Madrid, Spain.⁠\n⁠\nSome 40 world leaders attend the summit, running from 29 to 30 June, focused on the ongoing Russian invasion of Ukraine. ⁠\n⁠\nSpain are hosting the event to mark the 40th anniversary of its accession to Nato.⁠\n⁠\n🔗 For the latest updates from the Nato conference, visit the link in our bio", "Britain and US bolster Nato defences over Russia threat.⁠\n⁠\nBritain and America are stepping up their defence of Nato’s eastern flank as the alliance dramatically shifts its position on the threat posed by Russia.⁠\n⁠\nBen Wallace, the defence secretary, said he would place more troops, ships and aircraft on standby to head to the region as President Biden announced he would station US forces in Poland permanently.⁠\n⁠\nAn extra 1,000 UK soldiers will be committed to Estonia, where there are already 2,000 troops, to create a brigade-sized force that can help defend against a possible Russian invasion.⁠\n⁠\nA few hundred extra soldiers could be sent to the country to run the new headquarters, with a brigadier in charge. The remainder of the troops will be based in the UK but will be ready to fly to Estonia within days.⁠\n⁠\nOne of the UK’s 65,000-tonne aircraft carriers and its escort ships, as well as other naval assets, will also be offered to the alliance for its 300,000-strong high readiness force, Wallace said at the Nato summit in Madrid.⁠\n⁠\n🔗 Read the full story by clicking the link in our bio⁠\n⁠\n📸 Jeff J Mitchell/Getty Images", "Passengers will be able to lie flat in sleeping pods for some of the world’s longest flights⁠\n⁠\n➡️ Swipe to find out more⁠\n⁠\n🔗 Link in our bio for the full story", "Dame Deborah James dies aged 40 with family at her side⁠\n⁠\nDame Deborah James, the podcaster who raised millions of pounds for research into bowel cancer in her final weeks, has died, her family has announced.⁠\n⁠\nJames, who was made a dame for her “tireless” work improving awareness of the disease, died at the age of 40 “peacefully surrounded by her family”.⁠\n⁠\nShe revealed in May that she had stopped active treatment and was receiving end-of-life care at her parents’ home in Woking, Surrey, supported by her husband, Sebastien, and their two children, Hugo, 14, and Eloise, 12.⁠\n⁠\nGenevieve Edwards, chief executive of Bowel Cancer UK, of which James was a patron, said: “She was a true inspiration. She turned her bowel cancer diagnosis into an incredible force for good, and through her tireless campaigning to raise awareness of bowel cancer symptoms will have saved countless lives.\"⁠\n⁠\n🔗 Read the full obituary via the link in bio⁠\n📸 John Angerson", "Because the parameters of \"middle age\" have been generously expanded over the years, Tim Dowling thought he might avoid old age altogether ...\n\n\"But I know this to be a mere technicality; a loophole, and slim comfort,\" he writes in his latest Guardian article. \"I’m 59, and that’s pretty old. So old it doesn’t feel like a privilege, even if it’s preferable to the alternative.\"\n\n\"What have I learned about what it’s really like to get old? Not a lot, but here it is. I thought I’d better write it down before I forget it.\"\n\nFrom passing on wisdom to the rise of involuntary grunts: swipe to read Tim's favourite lessons and musings so far.\n\nIllustrations: @stevengregor_ \n\n#ageing #wisdom #lifelessons #howtoagewell #health #wellbeing", "Today marks 50 years since the UK’s first Pride march.\n\nOn 1 July 1972, Peter Tatchell and 30 other members of the Gay Liberation Front (@gayliberationfrontuk) made history by organising the protest, which celebrated and fought for LGBTQ+ people in the UK.\n\nIt was a crucial turning point for the nation's LGBTQ+ rights movement and has inspired Pride marches every year since … Tatchell has been to every single one of them.\n\n‘To think what began in 1972 was one Pride with 700 marchers has now grown to 150 Pride events involving a million people. What a difference 50 years makes,’ @petertatchell1 said.\n\nWill you be going to a Pride parade this year? 🏳️‍🌈\n\nClick the link in bio for Tatchell's piece on why he doesn't welcome uniformed police at Pride in London.\n\nSlides 1, 4, 5,6, 8: Jamie Gardiner\nSlide 2: LGBTQ+ Archives at Bishopsgate Institute(@bishopsgateinstitute)\nSlide 3: Everett/Rex Shutterstock via Getty\n\n#Pride #LGBT #LGBTQ+ #Gay #Protest", "‘You destroyed so many lives.’\n\nThe victims of R Kelly spoke with emotion about the impact his crimes had had on them.\n\nAt the trial, several women testified in court against the US singer, who was sentenced to  30 years in prison.\n\nThey described how Kelly, real name Robert Sylvester Kelly, subjected them to perverse and sadistic sexual abuse when they were underage.\n\nIn this video, we hear from two of the victims, Lizzette Martinez and Jovante Cunningham, who say they are ‘grateful’ for their abuser's conviction and sentence.\n\nAfter passing sentence, judge Ann Donnelly spoke directly to Kelly, saying: “These crimes were calculated and carefully planned, and regularly executed for almost 25 years. You taught them that love is enslavement and violence.”\n\nKelly’s conviction represents a victory for survivors of sexual violence and attracted attention in light of the #MeToo movement, in which powerful men have been held to account for their exploitation and sexual assault of women and girls.\n\n#RKelly #Kelly #MeToo #Womenrights", "‘Deborah’s amazing attitude was humbling and a lesson to us all.’\n\nTributes have poured in for Dame Deborah James, the ‘extraordinary’ podcaster and cancer campaigner, who has died at the age of 40.\n\nDiagnosed with stage 3 bowel cancer in 2016, James began blogging about her diagnosis under the name of BowelBabe, and became best known for candidly and humorously sharing her experience of the disease as a host of the BBC podcast You, Me and the Big C.\n\nJames was made a dame a few days after the launch of her fundraiser for cancer research, the @bowelbabefund, which has so far raised more than £6m.\n\nThe NHS chief executive, Amanda Pritchard, said: ‘Not only will her fundraising have helped countless other cancer patients but her determination to raise awareness will undoubtedly have saved many lives.’\n\nIn James's final message, shared by her family on her Instagram account, she said: ‘Find a life worth enjoying; take risks; love deeply; have no regrets; and always, always have rebellious hope. And finally, check your poo – it could just save your life. x’\n\n#BowelBabe #DeborahJames", "“Abominable”\n\nWorld leaders have denounced Russia’s deadly strike on a shopping centre in the Ukrainian city of Kremenchuk as “an abominable attack” and a war crime.\n\nEighteen people are known to have been killed, with 21 still missing, as rescuers continue working to recover bodies from the rubble.\n\nAuthorities say there were more than 1,000 people inside the mall at the time on Monday afternoon.\n\nThe Ukrainian defence ministry said the strike was deliberately timed to coincide with the mall’s busiest hours and cause the maximum number of casualties.\n\n#ukraine #ukrainewar #ukrainerussiawar #kremenchuk #warcrime #g7", "“If you have ever been pregnant, the thought of being made to go through it against your will is sickening,” writes @rhiannonlucycosslett for a Guardian opinion piece.\n\nCosslett shares her fears for Americans now their constitutional right to abortion has been removed.\n\n“Pregnancy is often the closest a woman comes to death in her lifetime (I remember reading that pregnant women dream frequently of death, how it feels like dancing next to its billowing curtain). It can kill you, and in the US, it is now more likely to do so,” she writes.\n\nSwipe to read part of her opinion piece on the overturning of Roe v Wade – and click the link in bio for the full column.\n\n#RoevWade #Women #WomenRights #Abortion", "Over 50 years, Dr Jim Taggart created one of Scotland's most magical gardens on the Rosneath peninsula in Argyll and Bute.\n\nThis portrait of him in his greenhouse was taken by photographer Robbie Lawrence not long before he died in 2019, aged 84.\n\nThe renowned botanist and climate activist welcomed many visitors to his garden - where he and his late son, Jamie, collected around 4,000 plant species from across the world, including rare magnolias and acers, 40 kinds of bamboo, and 300 different rhododendrons.\n\nTaggart's portrait is now just one of a series of stunning images of rural Scotland that Lawrence has included in his first UK solo exhibition, Northern Diary.\n\nIt brings together a selection of work he has produced over the past seven years, documenting his relationship with his homeland during a time of political upheaval.\n\nNorthern Diary opened at Stills in Edinburgh on 1 April.\n\nJim Taggart in his greenhouse at Linn Gardens.\n\nLewis Daniel, photographed at Edinburgh Waverley train station while waiting for a taxi with his family.\n\nScottish dancer Beatrice Finkler waits for her mum to pick her up outside a dance hall in Inverness.\n\nA lone tree on the Applecross.\n\nA man walking his dog climbs through a fence in Ayrshire.\n\nLachlan Duguid, a young Scottish dancer, practises outside a local community scout hall in Inverness.\n\nTwo schoolboys playing among the rock pools on Dunbar beach.\n\nJim Taggart giving away a flower that had fallen from a bush at Linn Gardens.\n\n#scotland #caledonia #inverness #highlands #photography #portraitphotography #landscapephotography", "‘One of our darkest days.’\n\nOutrage and disappointment swept the US after the supreme court decision overturning the constitutional right to an abortion, upending federal reproductive protections set nearly 50 years ago in the landmark Roe v Wade case.\n\nPro-choice democrats, activists and celebrities have decried the opinion as a painful blow to rights for millions.\n\nMeanwhile, Joe Biden denounced the opinion as “so extreme”, emphasizing the wide-reaching effect it will have on reproductive health nationwide. “Now with Roe gone, let’s be very clear: the health and life of women in this nation are now at risk,” said Biden.\n\nBiden said his administration will work to protect other means of accessing abortion in restrictive states, including abortion pills by mail, the ability to obtain out-of-state abortions, and other ways. “If any state or local official, high or low, tries to interfere with a woman’s exercise of her basic right to travel, I will do everything in my power to fight that deeply un-American attack,” said Biden.\n\nSwipe to see more reactions to the ruling.", "Protests quickly erupted outside the supreme court after its conservative judges overturned Roe v Wade and ended the constitutional right to an abortion.\n\nProtesters young and old joined together to condemn the decision, amid scenes of anger and sorrow.\n\n“This has been a fight 30 years in the making to overturn women and people’s fundamental rights to make decisions about their body. There is no coming back from this. There is no response other than outrage and action,” said Sara Kugler of Washington DC, who was standing outside the court building.\n\n“This will not succeed. Abortions are still going to happen. God forgive them for they know not what they do,” another Washington area resident, who asked to use her first name, Cathy, said.\n\n“They’re dividing our country even more. They really are. They’re making it more complicated. It could have settled it and stopped with this religious push. And this religious push from presidents like Trump who are not even qualified to lead us – it’s horrible,” she added.\n\nRepresentative Maxine Waters, a senior Democrat from California, stopped to speak with the Guardian as she walked in front of the supreme court building.\n\n“I don’t care what that vote is today. They can not stop us. They cannot control our lives. We’re going to do everything that we can possibly do – we’re going to continue to organize,” she said.\n\nWhen asked what the pro-choice side was planning to do in reaction to the court’s decision, she said: “We’re going to turn out a huge vote of women. We’re going to see if we can get something on the ballot real soon. We’re going to do everything we can possibly do.”\n\nPhotos: Jacquelyn Martin/AP, Evelyn Hockstein/Reuters, Allison Bailey/NurPhoto/REX/Shutterstock, Anna Moneymaker/Getty Images, Evelyn Hockstein/Reuters, Jacquelyn Martin/AP Photo, Jae C Hong/ AP Photo", "The supreme court just overturned the landmark Roe v Wade case, which granted women in the US the right to terminate a pregnancy. \n\nA reversal of this magnitude is almost unprecedented, particularly on a case decided nearly 50 years ago.\n\nHistorically, the court has overturned cases to grant more rights. The court has done the opposite here, and its decision will restrict a constitutional right generations of Americans have grown up taking for granted.\n\nThe extraordinarily rare move will allow more than half of states to ban abortion, with an immediate and enduring impact on tens of millions of Americans.\n\nTo find out more, swipe to read our Q&A on the ruling.", "Now Roe v Wade has been overturned, what legal precedents could fall next?\n\nThis is the question on the minds of anxious same-sex couples in the US, after supreme court justice Clarence Thomas suggested that the rulings that protect same-sex relationships could be ‘reconsidered’ next.\n\nShocking as this is, for many it hasn’t come as a complete surprise. “I’ve been yelling this for the last five years,” says Suzanne Ford, who is trans and married to her wife, Beverly. “We’re the most easily visible thing that the right can point to that’s ‘wrong.’ It’s red meat for them. They’ve learned a lot from attacking us for years. It gave them some momentum.”\n\nThe most frightening thing about Roe’s undoing is that the supreme court was so zealous in undoing decades of precedent, says Alex Lemberg, a queer San Francisco attorney.\n\n“It’s not an automatic path to overturning [same-sex marriage] from overturning Roe,” he says. “Although certainly, I don’t put it past these Trump-appointed judges to be logically inconsistent.”\n\nFollow the link in bio for the full story.", "Joe Biden has said he would support changing the Senate filibuster rules to codify abortion rights nationally.\n\nThe filibuster requires 60 votes to advance most legislation in the evenly-divided Senate. All 50 Democrats and two Republicans say they would support, in theory, legislation codifying abortion, which leaves them 8 votes short of the 60-vote threshold. However, Democrats lack the necessary 50 votes to eliminate or change the filibuster rules.\n\nUnder pressure from pro-choice advocates for not doing enough, Biden said he would meet with a group of governors on Friday to discuss abortion rights. He told reporters he would announce long-promised actions by the federal government to protect abortion access at the event.\n\nGiven his evolution on abortion, Biden is asked if he is the party’s best messenger on the issue. He let out a chuckle: “Yeah, I am.”\n\n“I’m the president of the United States of America. That makes me the best messenger,” he said. “I’m the only president they got. And I feel extremely strongly that I’m going to everything in my power which I legally can do in terms of executive orders as well as push the Congress and the public.\n\nThe bottom line here is, if you care, if the polling data is correct, and you think this decision by the court was an outrage or a significant mistake: VOTE. Show up and vote. Vote in the off-year and vote vote vote. That’s how we’ll change it.”", "The supreme court has sided with Republican-led states to in effect hobble the federal government’s ability to tackle the climate crisis, in a ruling that will have profound implications for the government’s overall regulatory power.\n\nIn a move that will seriously hinder America’s ability to stave off disastrous global heating, the supreme court, which became dominated by rightwing justices under the Trump administration, has opted to support a case brought by West Virginia that demands the US Environmental Protection Agency (EPA) be limited in how it regulates planet-heating gases from the energy sector.\n\nThe case, which was backed by a host of other Republican-led states including Texas and Kentucky, was highly unusual in that it was based upon the Clean Power Plan, an Obama-era strategy to cut emissions from coal-fired power plants that never came into effect. The Biden administration sought to have the case dismissed as baseless given the plan was dropped and has not been resurrected.\n\nNot only was this case about a regulation that does not exist, that never took effect, and which would have imposed obligations on the energy sector that it would have met regardless. It also involves two legal doctrines that are not mentioned in the constitution, and that most scholars agree have no basis in any federal statute.\n\nHowever, the supreme court has sided with West Virginia, a major coal mining state, which argued that “unelected bureaucrats” at the EPA should not be allowed to reshape its economy by limiting pollution – even though emissions from coal are helping cause worsening flooding, heatwaves and droughts around the world, as well as killing millions of people through toxic air.\n\nIt’s the most important climate change case to come before the supreme court in more than a decade. It could also have sweeping consequences for the federal government’s ability to set standards and regulate in other areas, such as clean air and water, consumer protections, banking, workplace safety and public health.", "Just in: R Kelly has been sentenced to 30 years in prison for sexually abusing women, girls and boys.\n\nKelly’s conviction has been seen as a victory for survivors of sexual violence, particularly those who may hesitate to speak out against abusers, for fear of retribution.\n\nLast September, a jury in New York City found Kelly guilty of sex trafficking and racketeering, on all nine counts against him.\n\nProsecutors had sought a sentence of at least 25 years.\n\nKelly follows Harvey Weinstein, Bill Cosby and other prominent abusers in being sentenced to time behind bars, although Cosby was acquitted on appeal.\n\nKelly vehemently denied all accusations, and memorably stood up and shouted at the CBS journalist, Gayle King, in 2019.\n\nBut a 31-page sentencing memorandum filed by the federal prosecutors in the eastern district of New York, said, in part: “With the aid of his inner circle and over a period of decades, the defendant preyed upon children and young women for his own sexual gratification.\n\n“In order to carry out his many crimes, the defendant relied upon his fame, money and popularity as an R&B recording star and used the large network of people his status afforded him – including his business managers, security guards and bouncers, runners, lawyers, accountants, and assistants – to both carry out and conceal his crimes.”\n\nKelly faces further legal trouble. In federal court in Chicago, he is charged with enticement of a minor, possession of child abuse images and obstruction of justice. That trial is set to be held in August.", "The extremist Colorado Republican congresswoman Lauren Boebert won her primary on Tuesday night, shortly after attacking the separation of church and state under the US constitution.\n\n“I’m tired of this separation of church and state junk,” she said.\n\nA dedicated controversialist first elected in 2020, backed by Donald Trump and described by NBC News as a “Maga lightning rod”, Boebert convincingly beat Don Coram, a state senator, for the nomination to contest the midterm elections.\n\nAt one event recently Coram, 74, told voters: “My politics are very similar to my driving. To the chagrin of both my wife and my Republican colleagues, I tend to crowd the center line and sometimes I veer over a bit.”\n\nIn contrast, Boebert has heckled Joe Biden during the state of the union address; made racist attacks on Ilhan Omar, a Democrat from Minnesota; vowed to carry a gun onto the House floor; and voted to object to results in key states in the 2020 presidential election.\n\nBoebert beat Coram by 31 points.\n\nOn Sunday, two days before the primary and in comments first reported by the Denver Post, Boebert told a religious service: “The church is supposed to direct the government. The government is not supposed to direct the church. That is not how our founding fathers intended it.”\n\nThe first amendment to the US constitution, from 1791, says: “Congress shall make no law respecting an establishment of religion, or prohibiting the free exercise thereof.”\n\nThis is widely held to mean church and state should be separate. Critics charge that the US supreme court is now among rightwing bodies which dispute that.", "Donald Trump wanted to go to the Capitol with his supporters on January 6, and reacted with rage when aides told him he could not do so, a key witness in the January 6 hearings has testified.\n\nIn a surprise appearance before the panel, Cassidy Hutchinson, a top aide to Trump’s last chief of staff Mark Meadows, detailed Trump’s rage at his staff – including a moment when he tried to choke a Secret Service agent.\n\nAccording to her testimony, Trump told a Secret Service agent, “I’m the effing president, take me up to the Capitol now.”\n\nThe agent responded that he could not take Trump to the Capitol, promoting him to try to grab hold of the steering wheel of the presidential limousine, known as “the Beast”.\n\nWhen that failed, Trump lunged for the agent’s throat, Hutchinson said. That same agent listened to Ornato as he recounted the story to Hutchinson.\n\nEarlier in her testimony, Hutchinson also detailed how Trump dismissed warnings from Secret Servive about his supporters that were carrying weapons and being prevented from entering his January 6 rally. \n\nHutchinson texted one of her colleagues that Trump was “fucking furious” about the crowd size at his event and wanted the Secret Service to remove the metal detectors to allow more people in.\n\nHutchinson said, “I was in the vicinity of a conversation where I overheard the president say something to the effect of, ‘I don’t f’ing care that they have weapons. They’re not here to hurt me. Take the f’ing mags away. Let my people in. They can march the Capitol from here. Let the f’ing people in.’”", "Just in: Ghislaine Maxwell was sentenced to 20 years in prison in her New York sex-trafficking case for procuring teen girls for Jeffrey Epstein for him to abuse. Maxwell, 60, has maintained her innocence.\n\nEpstein, a convicted sex offender and financier whose elite associates once included Prince Andrew and Bill Clinton, was captured by federal authorities in July 2019, on sex-trafficking counts. He killed himself in a New York City federal jail just over one month after his arrest.\n\nMaxwell’s attorneys had pushed for leniency in sentencing, saying that she should receive “well below” the 20 years recommended by federal probation officials. Prosecutors pushed for a sentence of 30 to 55 years in prison.\n\nMaxwell was convicted in December of five of the six charges she faced.\n\nIn addition to sex trafficking, Maxwell was convicted of conspiracy to entice individuals under the age of 17 to travel in interstate commerce with intent to engage in illegal sexual activity, conspiracy to transport individuals under the age of 17 to travel in interstate commerce with intent to engage in illegal sexual activity; transportation of an individual under the age of 17 with intent to engage in illegal sexual activity; and conspiracy to commit sex trafficking of individuals under the age of 18.\n\nThe jury came to their decision after 40 hours of deliberations spanning six days.", "'They lied'\n\nPolitical pressure is mounting on Joe Biden to take more action to protect abortion rights across the US as firebrand New York congresswoman Alexandria Ocasio-Cortez called for supreme court justices to be impeached for misleading statements about their views on Roe v Wade.\n\nOcasio-Cortez’s remarks took aim at justices Brett Kavanaugh and Neil Gorsuch. Both were appointed by former president Donald Trump and had signaled that they would not reverse the supreme court’s landmark 1973 decision in Roe v Wade during confirmation hearings as well as in meetings with senators.\n\nOn Friday, Kavanaugh and Gorsuch formed part of the conservative majority which in effect ended legal access to abortion in most states, and Ocasio-Cortez said “there must be consequences” for that.\n\n“They lied,” the leftwing, second-term representative said on NBC’s Meet the Press. “I believe lying under oath is an impeachable offense … and I believe that this is something that should be very seriously considered.”\n\nOcasio-Cortez also mentioned impeaching Justice Clarence Thomas, whose wife Ginni emailed 29 Republican lawmakers in Arizona as she tried to help undermine Biden’s victory over Trump in the 2020 presidential election. Thomas has not recused himself from election-related cases, drawing criticism.\n\n“I believe that not recusing from cases that one clearly has family members involved in with very deep violations of conflict of interest are also impeachable offenses,” Ocasio-Cortez said.\n\nHouse members can impeach a judge with a simple majority vote. But to be removed from office a justice would need to be convicted by a two-thirds majority of the Senate.", "It may not have been surprising, but the supreme court overturning Roe v Wade still delivered a series of profound shocks about the state of America, writes Francine Prose.\n\n\"What’s shocking is this proof of the court’s desire and ability to control and punish women,\" she writes. \"What’s shocking is the memory of three of the current justices swearing, under oath, to preserve the precedent established by Roe v Wade.\"\n\nAnd the most shocking part? \"According to surveys that keep surfacing and being reported, a substantial majority of Americans support abortion rights and oppose the outright ban.\"\n\nBut what, if anything, can be done as such rights are stripped away? Swipe to read Francine's latest op-ed, and follow the link in our bio to read it in full.", "'Every single one of us has woken up today with less rights than we had yesterday'\n\nAlexandria Ocasio-Cortez (@aoc) took to the floor of the House on Friday to condemn the supreme court's overturning of Roe v Wade. \n\nIn a somber and at times scathing speech, she slammed the hypocrisy of those 'who claim to be protecting life' for not supporting universal healthcare or universal childcare, and vowed to fight the ruling.", "How close do sharks come to coastal shorelines? Closer than you may think.\n\nA recent study from the University of Miami says sharks – one of the largest predatory fish in the ocean – are moving closer to the world's coastlines.\n\nResearchers believe sharks prefer coastal waters due to fish carcasses discarded by fishermen and local fish businesses. Finding an abundance of food will lure them closer to beachfront.\n\nWater temperatures also play a part in shark behavior. As summer's water temperatures rise, the likelihood of sharks traveling into warmer coastal waters is higher.\n\nHere's what to know about sharks as you head to the beach.", "As many as 10,000 self-described hippies are expected to camp, party and pray for world peace this weekend at the 50th anniversary of the Rainbow Family of Living Light. The leaderless group meets annually to camp out on public land, with this year’s event in Colorado’s remote Routt National Forest. \n\nThe Rainbow Family was founded in part by veterans in 1972 who were struggling with alcoholism, drug dependence and what’s now recognized as PTSD. Barry “Plunker” Adams, 77, is among the group’s founders who said he needed a new way of coping after the Vietnam War.\n\nFor generations, the group has clashed with law enforcement over drug use, sanitation and damage to the forests. Normally, the Forest Service requires large groups to get a permit but the Rainbows decline to participate in that process, citing their First Amendment right to gather without government approval.\n\n“We do it in peace and try not to harm the Earth, and everyone gets to feel their individual sovereignty,” he said. “We’re not perfect. We’re just people.”\n\nPhotos by Trevor Hughes @hughesofthenews", "On the Fourth of July, Miki Sudo and Nick Wehry are expected to do something no other couple in America will: eat about 90 hot dogs and buns combined at the annual Nathan’s Hot Dog Eating Contest on Coney Island in New York.\n \nEach will shovel down the food during a 10-minute time limit, and Sudo and Wehry, who are engaged, will re-earn their nickname, \"The Hungry Couple.''\n \nThe chances of being dethroned?\n \n“It’s almost mathematically impossible,’’ Wehry said, with relish.\n \nIn 2020, Sudo and Wehry shattered the previous couples record by devouring a combined 88 hot dogs – buns included. Sudo ate 48½ and Wehry ate 39½. They’re back this year after Sudo took off the 2021 competition while she was pregnant.\n \nRead more about ‘The Hungry Couple’ at the link in our bio. / 📸: Julia Nikhinson, AP", "Taking a trip this summer? Here's what passengers need to know about air travel.", "After two years of a fast-moving pandemic housing market that saw home prices increase by over 20% year-over-year, can potential homebuyers finally expect a semblance of normalcy in the coming months?\n \n“The unusual market conditions of the pandemic have come to an end,” Lawrence Yun, the chief economist for the National Association of Realtors told USA TODAY. “The sellers just need to understand that whatever last year's price was, they cannot just boost up prices by another 20%. They would not find buyers using that philosophy.”\n \nBut, that doesn’t mean home prices are coming down anytime soon. Sellers are lowering listing prices from all-time highs, but they are not likely to return to pre-pandemic prices. \n \nAt $407,600, the median existing-home sales price exceeded $400,000 for the first  in May, marking a 15% increase from one year ago. \n \nRead the exclusive story at the link in our bio.", "Passengers on a Delta Air Lines flight from Michigan to Minnesota reported that the airline offered them $10,000 this week to give up their seat on an oversold flight.\n \nJason Aten, a tech columnist at Inc. magazine, wrote he was sitting on the outbound plane for waiting for the aircraft to leave the gate when a flight attendant got on the intercom, looking for eight volunteers to give up their seats on the flight, offering $10,000 each. \n \n“If you have Apple Pay, you’ll even have the money right now,” the flight attendant said, Aten wrote.\n \nThe move comes on the heels of Delta announcing in late May it was cutting 100 daily flights this summer as travel demand heats up. Delta CEO Ed Bastian apologized Thursday for flight delays and cancellations that have tormented travelers in recent weeks as the airline's pilots took to picket lines to complain about overscheduling, \"poor reliability\" and contract disputes.\n \nEarlier this week, the airline announced that passengers flying over the July Fourth weekend will not have a fare difference when rebooking travel.\n \nRead more at the link in our bio. / 📸: John David Mercer-USA TODAY NETWORK", "Princess Diana was born on July 1, 1961. \n\nDiana Frances Spencer would not become Lady Diana until 1975 when her father inherited his Earldom. \n\nPrincess Diana tragicially died on Aug. 31, 1997. We look back on her life in photos.\n\n📸  @gettyimages @apnews", "A fast-growing California wildfire has grown to more than 900 acres in four days, prompting evacuation orders for hundreds of residents of nearby communities, fire officials said.\n\nThe blaze, named the Rices fire, is in Nevada County about 70 miles northeast of Sacramento, according to information from the National Interagency Fire Center. \n\nThe fire began about 2 p.m. Tuesday near the Yuba River. As of late Thursday, firefighters had about 20% of the blaze contained, the California Department of Forestry and Fire Protection reported.\n\nSo far, 13 firefighters and one civilian have been injured, CalFire reported. The injuries were heat-related, such as dehydration.\n\nFor more updates on California wildfires, click the link in our bio.", "Military parents with transgender kids across the country are increasingly worried about what getting assigned to duty stations in GOP-led states could mean for their family's wellbeing.\n\nSome parents, like Alleria Stanley, are leaving the military to avoid the possibility of getting assigned to states like Texas, Alabama and Florida, which are home to large military bases and some of the country's harshest measures targeting LGBTQ youth.\n\nWith so many different anti-LGBTQ laws to worry about, some military families have decided to leave the armed services altogether to move to a state with LGBTQ protections. \n\nRead more about how these military families are trying to protect their LGBTQ children through our link in bio.", "The politicized trial for WNBA superstar Brittney Griner begins as fellow players (and even Congress) are fighting for her return to the United States.", "It’s time to bring back indoor mask-wearing requirements, some health professionals say amid concerns of a potential surge in COVID-19 cases this summer.⁠\n⁠\nIn fact, according to Alberta emergency physician Chuck Wurster, public-health authorities across the country dropped the mask mandate prematurely.⁠\n⁠\nOver the past month, countries such as the U.S., Israel, Portugal, France and Italy have seen a rise in COVID-19 cases.⁠\n⁠\nAnd with the emergence of infectious Omicron subvariants – particularly BA.4 and BA.5 – there are concerns that Canada, too, will be hit with another wave in the coming months.⁠\n⁠\nCurrently, masks are required in Canada for air and train passengers, but in most settings, they are no longer compulsory.⁠\n⁠\nMandating masks again in indoor public places is one immediate way to fend off another potential surge, according to some doctors.⁠\n⁠\nFollow the link in bio for the full story by Wency Leung.⁠\n⁠\n#COVID19 #COVID #Masks #Masking", "When does a new country begin to feel like home? Is it when you become a citizen, learn a new language, vote in your first election or something more personal?⁠\n⁠\nThe Globe asked readers who weren’t born in Canada but live here now to share their “welcome to Canada” story – the moment they felt like they belonged.⁠\n⁠\nFollow the link in our bio to read all 10 stories.⁠\n⁠\nPhoto 2 by Tijana Martin, Photo 3 by Cole Burston and the rest handouts.⁠\n⁠\n#CanadaDay #Canadian", "Inside my conference swag bag was a sweatshirt that proclaimed: “Home is Canada.” It was a beautiful gift, yet it gave me pause. As a preteen transplant from Trinidad and Tobago, I wondered if wearing it meant declaring definitively that Canada was my only home?⁠\n⁠\nI am a Canadian citizen. I love this country. I attend Canada Day parties and wave my red and white flag. I watch hockey, occasionally. I love maple syrup, poutine and Beaver Tails. I have been to the eastern and western provinces and plan to visit the remaining in between. I work here, I pay taxes, I own a cottage (which is quintessentially Canadian), and still, it felt almost traitor-like to wear that sweatshirt. The misgivings about the wording caught me by surprise. I needed to reflect on these emotions.⁠\n⁠\nEventually, I honed-in on the real issue: Canada was not exclusively my home. Trinidad had been my home for 12 years, my formative years. So many family members live there still. They are people. My roots. My anchor.⁠\n⁠\nThe call of the Caribbean Sea is sometimes too much to bear. The beats of soca, calypso, parang and chutney music live in my soul. Trinidad’s foods and drinks pepper my cuisine, more now than ever as I make a concerted effort to pass along my culture and traditions to my child.⁠\n⁠\nSo, how could Canada be my only home?⁠\n⁠\nIdeally, the sweatshirt should have said: “Home Is Where the Heart Is.” And to that, I would have exclaimed, Yes!, for my heart is split across two nations and has been for almost three decades. I expect it will be for eternity.⁠\n⁠\nI am grateful that I belong to two countries, so I wore the sweatshirt on the second day of my conference. I’ve worn it many times since, with pride and a sense of peace knowing that while my roots are firmly anchored in one country, my branches are spread across to another.⁠\n⁠\nClick the link in our bio to read the full essay by Stacey-Ann Sukharrie. Illustration by April Dela Noche Milne (@apricotjoy)⁠\n⁠\n#Canada #TrinidadandTobago #CanadaDay #Canadian", "It’s been a year since Lytton, B.C. burned down in a wildfire during a record-setting heat wave. But the town still looks like a disaster zone.⁠\nCrumbled buildings lie all over the community. Explosion marks and debris from cars and propane tanks are still scattered on the streets. Pieces of metal are littered around the sidewalks.⁠\n⁠\nTowns typically finish cleaning debris and start rebuilding just a few months after a major disaster. But it took 10 months for debris removal to begin in Lytton.⁠\n⁠\nThe difference here is the archeological significance of the land below the town.⁠\n⁠\nExperts estimate that Indigenous people first settled in Lytton as many as 10,000 years ago and used the area as a meeting place between coastal and interior bands. The chances of finding artifacts or human remains are considered to be very high.⁠\n⁠\nRebuilding a town that has been as thoroughly destroyed as Lytton is difficult enough. The addition of an unprecedented amount of archeological work on every property in town has slowed work to a crawl.⁠\n⁠\nNow governments and insurance companies are hashing out costs as experts figure out how to properly protect the Indigenous history buried below.⁠\n⁠\nFollow the link in our bio for the full story by Salmaan Farooqui. Photography by Melissa Tait (@meltait)⁠\n⁠\n#LyttonBC #Wildfire #BritishColumbia", "The Ontario government should formally declare intimate partner violence an epidemic, says an inquest jury after three weeks of testimony into a rural triple femicide nearly seven years ago.⁠\n⁠\nThe call is the first of the jury’s 86 recommendations in response to the murders of Carol Culleton, Anastasia Kuzyk and Nathalie Warmerdam by a mutual ex-partner on Sept. 22, 2015.⁠\n⁠\nThe bulk of the action items are directed at the provincial government, and include calls for bolstered and consistent funding for intimate partner violence, or IPV, resources; enhanced education in schools and continued training for law enforcement personnel; and the exploration of justice-system reforms.⁠\n⁠\nThey also include specific proposed changes to the criminal code and to the Coroner’s Act, to recognize femicide as a distinct crime and manner of death. They also call on stricter conditions for serial IPV offenders on bail or probation – but also expanded rehabilitative supports.⁠\n⁠\nPamela Cross, a lawyer who provided testimony at the inquest, said she was moved by their call to recognize this as an epidemic, and also highlighted the jury’s recommendation to explore adding “femicide” to the Criminal Code.⁠\n⁠\nFollow the link in bio for the full story by Molly Hayes⁠\n⁠\nFor help with controlling behaviour or intimate partner violence, call the Assaulted Women’s Helpline at 1-866-863-0511. In Quebec, call SOS violence conjugale at 1-800-363-9010.⁠\n.⁠\n.⁠\n#IntimatePartnerViolence⁠\n#DomesticViolence⁠\n#abuse", "Third Space Playback Theatre Edmonton is performing their brand of playback, a participatory form of improvisational theatre, where actors “played back” the stories audience members shared with them.⁠\n⁠\nThey collaborated with local grassroots organization Sisters’ Dialogue to organize an exclusive Playback Theatre performance just for Muslim women, mostly from the Edmonton area, to facilitate healing from the gendered Islamophobia and racism they’d experienced in the city and to foster sisterhood through art.⁠\n⁠\nOver the past two years, Edmonton and its surrounding area have seen a string of reported physical and verbal attacks against racialized Muslim women.⁠\n⁠\nFor Asha Yassin (pictured), seeing her story played back made her realize she wasn’t alone. Yassin, a counselling psychology student and Sisters’ Dialogue member, remembers feeling apprehensive about playback at first, but left feeling a sense of Muslim sisterhood.⁠\n⁠\n“My intersecting identities of being a Black, visibly Muslim woman make me such a vulnerable target,” Yassin shares. In her story, the hijab-wearing mother said she feels unsafe outside the walls of her home. Yassin says she’s been followed in stores and on the street multiple times, been verbally assaulted and even spat on in hateful incidents.⁠\n⁠\nIn her playback, the actors emphasized Yassin’s worry and desire for comfort and protection outside her home. She watched as performers repeated her words like “self-awareness” and acted out the walls that represented her safe haven from the racism and Islamophobia she encounters on a regular basis.⁠\n⁠\n“Sometimes you’re triggered and you’re afraid -- you’re worried it brings back emotions,” Yassin says. “But in this particular situation, I felt like this is a door that I could finally open to start my journey to healing.”⁠\n⁠\nFollow the link in our bio to read the full story by Rukhsar Ali. Photos by Amber Bracken (@photobracken)⁠\n.⁠\n@thirdspaceplayback⁠\n@sisters.dialogue⁠\n#CanadianTheatre", "Opinion: Legislating abortion access in Canada would be a mistake, writes health columnist Andre Picard.⁠\n⁠\nHe says, \"Well-meaning pro-choice activists who are calling for legislative and constitutional protections are being sucked into a trap.⁠\n⁠\n\"The right to abortion is already constitutionally protected in Canada. The Morgentaler ruling on Jan. 28, 1988, made that clear.⁠\n⁠\n\"Once you have a law, even one that guarantees access to abortion and other reproductive health services, it can serve as a platform for opponents to launch attacks, and protections can be whittled down with restrictions on who has access, when and how.⁠\n⁠\n\"Abortion is a medical procedure like any other. The when, where and how should be determined in a patient-practitioner dialogue, guided by medical codes of ethics, evidence-based guidelines and clinical protocols.⁠\n⁠\n\"If anything, what is unfolding in the U.S., the overturning of the landmark 1973 Roe v Wade ruling, should serve as a cautionary tale about what can happen when legislators stick their noses where they don’t belong.⁠\n⁠\n\"Despite the lack of legislation, Canada is far from being a model of reproductive health delivery.\"⁠\n⁠\nFollow the link in our bio to read the full opinion piece.⁠", "The stunningly preserved carcass of a baby woolly mammoth frozen in Yukon permafrost is being hailed as the most complete specimen of the extinct species ever found in North America.⁠\nThe baby mammoth was spotted by gold miners who uncovered it while working at Eureka Creek near Dawson City.⁠\n⁠\nA preliminary examination by experts revealed the mammoth to be a female, about 140 centimetres long. The creature is estimated to have been about one month old when it died some 30,000 years ago.⁠\n⁠\n“She’s complete from tail to the tip of her trunk, with eyelids and ears and little toe nails,” said Grant Zazula, a paleontologist with the territorial government, who called the discovery a “once in a lifetime” find.⁠\n⁠\nFollowing its discovery and removal from a cliff face, the specimen was transported to a freezer for preservation. It falls under the stewardship of the Trʼondëk Hwëchʼin First Nation on whose traditional territory it was found.⁠\n⁠\nAt a ceremony earlier this week, the mammoth was named Nun cho ga by Trʼondëk Hwëchʼin Elders, which translates to “big baby animal” in the Hän language.⁠\n⁠\nFollow the link in bio to read the full story by Ivan Semeniuk. Photo by Grant Zazula / The Canadian Press.⁠\n.⁠\n.⁠\n#Mammoth #WoollyMammoth #Science #Yukon #Paleontology", "Roe v. Wade’s fall sets a ‘frightening precedent,’ retired Canadian Supreme Court justice Rosalie Abella says.⁠\n⁠\nShe and Louis LeBel, both retired judges of Canada's Supreme Court, criticized the U.S. Supreme Court decision on Friday to end the nationwide right to an abortion, saying it freezes rights in much older times and shows why that court has lost its influence on this country’s judges.⁠\n⁠\nThe central idea in the ruling to overturn the precedent set in Roe v. Wade in 1973 was that, in the view of the majority, the right to an abortion did not exist in the United States until late in the 20th century. Rights that are not explicitly protected by the U.S. Constitution’s due-process clause must be grounded in the country’s history to merit protection, it said.⁠\n⁠\n“I think this is a perfect decision for the 18th century,” Ms. Abella said in an interview. She retired last summer after 17 years on the Supreme Court of Canada.⁠\n⁠\nMr. LeBel, who served on the Supreme Court of Canada from 2000 to 2014, called the majority’s approach to rights and history “respectfully, plainly wrong.”⁠\n⁠\n“What we call ‘new rights’ developed through legal interpretation,” he said in an interview. “Those rights that were recognized in the past were new at some point in time. They came into being because courts acknowledged them, upheld them, recognized them.”⁠\n⁠\nIn dissent, three of the U.S. judges took an approach similar to that found in Canadian rulings: That a right to autonomous decision-making in the most personal decisions of life has grown over time, resulting in protection of the rights to contraception, gay sex and gay marriage.⁠\n⁠\nFollow the link in our bio for the full story by Sean Fine.⁠\n⁠\n#RoeVWade", "Opinion: In 1972, the notion of gay people appearing unashamedly in public was unthinkable to many.⁠\n⁠\nAuthor Hugh Brewster writes about being a part of the first Toronto Pride Parade: “No one in that small cohort of (mostly) twentysomethings who marched behind a bedsheet gay-pride banner on Aug. 26, 1972 could have imagined a full month of Pride celebrations with rainbow flags adorning banks, schools and even some churches, and Yonge Street crammed with Pride revellers in the hundreds of thousands.⁠\n⁠\n“Of the activists of the seventies, Gerald Hannon would memorably claim: “We grabbed today and shook it until tomorrow fell out of its pocket.“”⁠\n⁠\nFollow the link in our bio for the full opinion essay from Hugh Brewster⁠\n⁠\nImage 1: Gay Pride Parade in Toronto, 1972. The march up University Avenue. Jearld Moldenhauer⁠\n⁠\nImages 2+3: People march in the Pride parade in downtown Toronto, marking the return of in-person festivities for the annual LGBTQ celebration, in Toronto, June 26, 2022. Eduardo Lima/The Canadian Press⁠\n⁠\n#Pride #TorontoPride #PrideParade", "The year 2022 is a big one for Egyptologists. British archaeologist Howard Carter’s discovery of King Tut’s tomb marks its centennial on November 4. It’s also the 200th anniversary of the decipherment of hieroglyphics, which the French scholar Jean-François Champollion achieved in 1822 by comparing the Rosetta Stone’s trilingual inscriptions. ⁠\n⁠\nMeanwhile, a series of archaeological discoveries have been announced over the past two years, the most spectacular from Saqqara, an ancient city on the outskirts of Cairo, where excavators found 250 exquisitely decorated sarcophagi; and near Luxor, where a “lost golden city” was unearthed in 2021. This recent wave of archaeological discoveries and museum openings has made the experience feel novel. Read more at the link in bio (or on Apple News +) (🖊️: @tonyperrottet, 📷: @quentindebriey) ⁠", "The woman alleged to be at the heart of one of the world’s biggest cryptocurrency frauds is now on the Federal Bureau of Investigation’s 10 Most Wanted Fugitives list, according to the agency.⁠\n⁠\nRuja Ignatova is accused of operating a world-wide pyramid scheme that took in more than $4 billion from 2014 through 2016 through the purported cryptocurrency OneCoin, according to law enforcement.⁠\n⁠\nIgnatova, known among her followers as the Cryptoqueen, allegedly instructed people from across the world to send money to OneCoin accounts to purchase the cryptocurrency, according to the FBI. But OneCoin wasn’t actively traded and couldn’t be used to buy anything. Federal prosecutors said it was more of a pyramid scheme, with money from new purchasers flowing up to Ignatova and others who sold the currency in the early days.⁠\n⁠\nOneCoin made so much money that Ignatova and the other top sellers hardly knew where to put it, according to legal proceedings. They stacked it in cash in offices and apartments in Bulgaria, Hong Kong, Dubai and South Korea. They lent it out and plowed it into stables in Abu Dhabi for thoroughbred racehorses, according to the proceedings.⁠\n⁠\nA Bulgarian who once worked for McKinsey & Co., Ignatova was indicted by a federal grand jury in 2017, but remains at large. She traveled from Bulgaria, where the entity behind the scheme was based, to Greece in October 2017, according to the FBI.⁠\n⁠\n“Ignatova is believed to travel with armed guards,” the agency said.⁠\n⁠\nRead more at the link in our bio.⁠\n⁠\nPhoto: Paul Hampartsoumian/Shutterstock", "A roughly 44-acre private island in southwestern Alaska that was once used as a fox farm is listing for $20 million.⁠\n⁠\nThe island, located in the Kenai Peninsula Borough about 21 miles from the city of Homer and about 8 miles outside the small city of Seldovia, grows to 56 acres during low tide, according to Troy Dana of Fay Ranches, who shares the listing with Yvan Corbin of Real Broker.⁠\n⁠\nThe owner of the island is a a real-estate investor who lives primarily in Washington, Dana tells @wsjrealestate. \n⁠\nThere are currently no structures on the island, which has a pebble beach and about 7,000 feet of frontage on Cook Inlet. The water is likely too cold for recreational swimming, he said, but is home to sea life such as salmon, whales and otters, and can be used for fishing. ⁠\n⁠\nRead more at the link in our bio.⁠\n⁠\nPhoto: Iris Leonardo", "High gasoline prices are prodding more people to consider an electric vehicle. But car shoppers are likely to face sticker shock at the dealership, too.⁠\n⁠\nAuto makers have been raising prices on electric cars, partly to offset the soaring cost of materials used in their large batteries. Car executives also are capitalizing on strong consumer interest in EVs, as a new wave of plug-in vehicles hits the market.⁠\n⁠\nIn the past few months, Tesla, Ford, GM, Rivian and Lucid have increased prices on certain electric models.⁠\n⁠\nGM recently tacked on $6,250 to the price of GMC Hummer electric pickup-truck models, which now range from around $85,000 to $105,000, citing an increase in commodity and logistics costs. The waiting list for the recently released truck is about two years, a GM spokesman said.⁠\n⁠\nTesla this year has increased prices three times for a performance version of its top-selling Model Y SUV, adding a total of about 9% to the sticker price, which is now $69,900, according to Bernstein Research.⁠\n⁠\nOverall, the average price paid for an electric vehicle in the U.S. in May was up 22% from a year earlier, at about $54,000, according to J.D. Power. By comparison, the average paid for an internal-combustion vehicle increased 14% in that period, to about $44,400.⁠\n⁠\nRead more at the link in our bio.⁠\n⁠\nPhoto: Pool/Via Reuters", "Gardiner, Mont., the historic gateway town to Yellowstone National Park, is embarking on something it has never done before: getting visitors to ignore, at least for now, the famous wilderness preserve next door.⁠\n⁠\nA flood earlier this month turned the Yellowstone River into a raging torrent, destroying sections of the main highway entrance from the north—and severing Gardiner and the Paradise Valley nearby from a park that has long served as their economic mainstay.⁠\n⁠\nYellowstone is so big—encompassing 2.2 million acres in Wyoming, Montana and Idaho—that it has five entrances. Gardiner, founded in 1880, is the oldest and one of the most popular. Yellowstone reopened three entrances last week, leaving closed the ones at Gardiner and Cooke City, Mont., where flooding of other waterways destroyed more roads. Getting from Gardiner to the nearest open entrance, at West Yellowstone, Mont., is about a three-hour drive over mountain roads.⁠\n⁠\nThe flood also destroyed or heavily damaged more than 100 area homes, knocked out bridges and other infrastructure and left untold other structures compromised. Gardiner stands on high ground above the river as it always has, except now with eerily desolate streets. ⁠\n⁠\nThe economic fallout in the town, population 900, and surrounding Park County and its 17,000 people shows the vulnerability to disruptions of the hundreds of gateway communities in the national park system. In 2020, 237 million national park visitors spent $14.5 billion in local communities, including $444 million at Yellowstone, according to the most recent federal study.⁠\n⁠\n“These gateway communities are as essential to the operation of Yellowstone as Old Faithful,” said Bill Berg, a Park County commissioner.⁠\n⁠\nRead more at the link in our bio.⁠\n⁠\n📷: @janie_osborne for @wsjphotos", "Singer R. Kelly was sentenced Wednesday by a New York federal judge to 30 years in prison for racketeering and sex-abuse offenses.⁠\n⁠\nKelly was convicted last year of using his inner circle to recruit women and underage girls for sex. Jurors found him guilty of eight counts related to coercing and transporting women and girls to engage in illegal sexual activity and one count of racketeering, including that he had participated in acts of bribery, kidnapping, sexual exploitation of a child and forced labor.⁠\n⁠\nRead more at the link in our bio:⁠\n⁠\nPhoto: Antonio Perez/AP", "On June 29, 2007, the first iPhone went on sale. That same day, a boy named Noah Schmick was born. Over the next 15 years, the iPhone grew…and so did Noah. ⁠\n⁠\nThrough interviews with current and former Apple executives, @joannastern traces how Apple’s invention matured and changed all of us—perhaps the youngest generation most of all.⁠\n⁠\nWatch the full video at the link in our bio or at wsj.com/iphonebaby", "British socialite Ghislaine Maxwell was sentenced Tuesday by a federal judge to 20 years in prison for what prosecutors said was a decadelong scheme to help disgraced financier Jeffrey Epstein sexually abuse underage girls.⁠\n⁠\nAfter a trial late last year, a federal jury found Maxwell guilty of five of the six counts she faced. Four women testified during the trial that Maxwell recruited underage girls for Epstein, enabling his sexual abuse at properties in New York, Florida, New Mexico and elsewhere.⁠\n⁠\nThe most serious count, sex trafficking of minors, carried a maximum sentence of 40 years in prison. Prosecutors had asked for a term of at least 30 years, while defense lawyers said a term of significantly less than 20 years would be appropriate because they said Epstein was the principal abuser.⁠\n⁠\nRead more at the link in our bio.⁠\n⁠\nPhoto: U.S. Attorney’s Office/ZUMA Press", "It looks much like any modern gym on the inside. Except there are no cellphones, no Kindles or tablets, virtually no electronics of any kind, and only muted conversation among the smattering of patrons engaged in late-morning workouts.⁠\n⁠\nThey were exercising at the Central Intelligence Agency’s ultramodern “field house,” a stone’s throw from the spy agency’s hulking headquarters buildings on its fortified Northern Virginia campus in Langley, Va.⁠\n⁠\nThe 43,000-square-foot facility opened March 14, ending a more than two-decade quest to replace a pair of cramped and moldering basement gyms and finally bring the agency up to par with the athletic facilities found at military bases and on Capitol Hill. The gym symbolizes a recognition by its leaders, they said, that the agency needs to focus more on its people after over two decades of playing front-line roles in conflict zones around the world.⁠\n⁠\nNamed Langley Field House, the gym is intended to help the spy agency attract and retain workers as it competes with the private sector for technological expertise, those involved in its design and construction said. It sports the latest in accessibility features to accommodate the CIA’s disabled employees, including military personnel who retired and joined the CIA after being wounded in U.S. counterterrorism wars.⁠\n⁠\n“The pressures and strains faced by our officers and their families are unrelenting—with two decades shaped by counterterrorism threats followed by two years of COVID,” CIA Director William Burns wrote in response to questions about the new gym. “As an organization, we have learned that in order to maintain a high-performing, resilient organization, we need to take care of our officers.”⁠\n⁠\nRead more at the link in our bio.⁠\n⁠\nPhoto: Central Intelligence Agency", "Deshaun Watson’s sexual misconduct hearing is set to begin and the National Football League is preparing to make its case for one of the stiffest suspensions in the sport’s history.⁠\n⁠\nThe NFL is pushing for an indefinite suspension that would last no shorter than one year for Watson, people familiar with the matter said. That would mean he would be out for one season, at least, before he could apply to be reinstated. ⁠\n⁠\nA resolution on his future in the league is expected in the coming days, more than a year since the first allegations against Watson surfaced. The people familiar with the case anticipate an outcome the week of July 4, although there remains a chance of it coming sooner. His arbitration hearing is scheduled to begin this upcoming week. ⁠\n⁠\nThe NFL Players Association and Watson’s lawyers, meanwhile, are preparing to vigorously fight such a tough ban of the embattled Cleveland Browns quarterback. Watson has been accused by dozens of women of sexual assault or other forms of misconduct during massage therapy sessions. Watson, who has denied any wrongdoing, settled 20 of the 24 civil suits against him in the last week. ⁠\n⁠\nWatson’s is the first case under the NFL’s new collectively bargained personal conduct policy, which places the initial ruling in the hands of a neutral arbitrator. In this case, that is former U.S. District Court judge Sue Robinson, who was picked mutually by the league and the players’ union. If she determines Watson violated the league’s personal conduct policy and suspends him, either side can appeal the length of that suspension to commissioner Roger Goodell or someone he designates. ⁠\n⁠\nRead more at the link in our bio.⁠\n⁠\nPhoto: Nick Cammett/Getty Images", "Follow @latimes_sports for the latest updates on Britney Griner’s trial, as we will be sure to follow up with more reels for every major development in this case. \n\n🎥: @mediajonny & @cgpriceisright \n\n#britneygriner #britneygrinerrussianjail", "California Gov. Gavin Newsom on Thursday signed a controversial bill to repeal a provision of state law that bans loitering for the intent to sell sex — a proposal that deeply divided Democrats in the Legislature and pitted transgender rights activists against advocates to stop human trafficking.\n\nAnti-loitering laws have been contentious nationwide, in part because they are often vague in their definition of what constitutes as loitering, which gives police wide latitude to arrest or disperse individuals. While New York state and cities such as Seattle have repealed anti-loitering laws, California now becomes the largest state to do so.\n\nIn his signing statement released on Friday, Newsom alluded to the difficult political debate around the bill, but noted that it “does not legalize prostitution.”\n\nLink in bio for more. 📸 Paul Kuroda/For The Times", "“In these grim post-Roe days, more than half the states in the country are in the process of banning or severely curtailing access to abortion. In every state that outright bans abortion, that prohibition extends to medication abortion — a simple and safe two-pill regimen that has been available for more than two decades.\n\nBut it is not clear that bans on medication abortion are legal. Taking abortion pills is not the same as having a procedure in a clinic, and regulating drugs is not the same as regulating medical procedures. The U.S. Food and Drug Administration has long had the authority to decide what drugs are safe and efficacious and should be on the market. States regulate medical practice within their borders but generally do not have the right to override FDA decisions on drugs.\n\nIt’s time for the federal government to go to court and argue that every state banning medication abortion has overstepped its authority and is thwarting access to an FDA-approved drug,” writes the Times Editorial Board.\n\nLink in bio for more. 📸 Associated Press", "The groundwork that would ultimately lead to the #RoevsWade ruling began in #California. Cheryl Bryant was 22 at the time and in desperate need of an #abortion. In California, during the 1960s, it was a felony to perform, provide or procure an abortion unless necessary to preserve a woman’s life.⁠\n⁠\nCheryl knew that it was the right thing for her to do. Her doctor was arrested shortly after performing it. But In her opinion, he saved her life.⁠\n⁠\nThe legal battle over her abortion led to the state’s high court legalizing the procedure in California, and the case was cited in the U.S. #SupremeCourt while handing down its landmark decision to legalize it in #1973.⁠\n⁠\nNow, California is working to become a #sanctuary for all seeking an abortion after Roe vs. Wade was #overturned last week.⁠\n⁠\nRead more at link in bio.⁠\n📷️ : Cheryl and Cliff Palmer family photo / Courtesy of Amy Stone /  Wally Fong, Associated Press / @pixtakerirfan", "Days after the U.S. Supreme Court ruled that states can prohibit abortion, Alabama has seized on the decision to argue that the state should also be able to ban gender-affirming medical treatments for transgender youths.\n\nThe case marks one of the first instances of a state trying to apply the abortion ruling to other realms, as LGBTQ advocates and others were afraid would happen.\n\nLink in bio for more. 📸 Associated Press", "Gov. Gavin Newsom just signed into law key elements of a new $307.9-billion state budget, a spending plan centered on gas refunds for 17.5 million taxpayers to soften the sting of high fuel prices and the cost of living.⁠\n⁠\nThe refunds, varying from as little as $200 for individuals up to $1,050 for couples with children, are the hallmark of the state’s effort to return a portion of an anticipated $101.4-billion surplus back to Californians. The governor and lawmakers also invested heavily in K-12 public education, directed billions of dollars to secure enough power to keep the lights on during heat waves and earmarked $47 billion for infrastructure projects over the next three years.⁠\n⁠\nLink in bio for more information. 📸 Natallie Rocha", "WNBA star Brittney Griner is scheduled to stand trial Friday in a court outside Moscow on cannabis possession charges, more than four months after her arrest at an airport while returning to play for a Russian team.⁠\n⁠\nRead more at link in bio.⁠\n📷️: Kirill Kudryavtsev / AFP, @robgauthier, Alexander Zemlianichenko / Associated Press, Darryl Webb / Associated Press", "#History in the making! #KetanjiBrownJackson was sworn in as an associate justice of the U.S. #SupremeCourt on Thursday, shattering a glass ceiling as the first Black woman on the nation’s highest court.\n\nChief Justice John G. Roberts Jr. administered the #ConstitutionalOath to Brown Jackson (above).\n\nShe is the court’s 116th justice.\n\nSee more at link in bio.\n\n#foryou #mustwatchvideo #scotus #justice", "USC and UCLA are negotiating to leave the Pac-12 for the Big Ten Conference, multiple sources confirmed to the Los Angeles Times Thursday morning.⁠\n⁠\nThe Trojans and Bruins have been flagship members of the West Coast’s power conference for nearly a century. Their departure to the Chicago-based Big Ten would signify a death blow to the notion of the Pac-12 as a competitive, top-level football conference.⁠\n⁠\nIf USC and UCLA make the move official, the “Power Five” will move closer to a “Power Two” as college sports continues to reimagine its future in the era of name, image and likeness and player empowerment.⁠\n⁠\nRead more at link in bio.⁠\n📸: Allen J. Schaben/Los Angeles Times⁠\n⁠\n⁠\n#USC #UCLA #Big10 #Pac12 #BigTen #collegesports #collegefootball #collegebasketball #california #sports", "It's official! Ketanji Brown Jackson was sworn in as an associate justice to the Supreme Court on Thursday, making history as the first Black woman to serve on the high court.⁠\n⁠\nShe is replacing Justice Stephen Breyer, who is now retired.⁠\n⁠\nBrown Jackson was nominated by President Joe Biden in February and confirmed by the U.S. Senate in April.⁠\n⁠\nRead more at link in bio.⁠\n📸: Jacquelyn Martin/Associated Press⁠\n⁠\n⁠\n#SCOTUS #KetanjiBrownJackson #swearingin", "The recent Supreme Court ruling on abortion will jeopardize the health and lives of countless Americans and will have a major impact on a range of other reproductive and health services. This is unacceptable. As we fight for for an individual’s right to control decisions about their reproductive health, we need your support. Donate now at APHA.GivingFuel.Com/MyBodyMyChoice", "Registration & housing is now open for #APHA2022! Don’t miss your opportunity to engage, collaborate and grow your public health career! Check out our special rates for students and early-career professionals. Register before July 25 to save even more with our early-bird discount. We’re looking forward to seeing you in Boston Nov. 6-9! APHA.org/AnnualMeeting and link in bio #PublicHealthReunion", "Today's Supreme Court’s decision on abortion is a catastrophic judicial failure that will jeopardize the health & lives of Americans, APHA says. It \"sets the nation back decades & demands action by all of us to protect reproductive freedom.\" Swipe to read our statement (Photo by Gayatri Malhotra via Unsplash)", "Happy first day of summer! ☀️🏖️🌴Start the season right with APHA's Summer Keep It Moving Challenge, happening now through Labor Day. It's free, you can win prizes and you don't have to be an APHA member to join. Visit HekaHealth.com/APHA-Summer-2022 to sign up now! Link in bio", "Thank you to all the amazing presenters, panels and energetic participants — both online and in Washington, D.C. — who were part of today's APHA Policy Action Institute. We're feeling inspired to #SpeakForHealth and work for transformative public health policy in our communities! Missed today's event? Check our website next week for access to recordings! APHA.org/PAI or link in bio. (Photos by Gayatri Malhotra, @gdm.photographs) For more photos, see our Flickr feed: Flickr.com/aphapublichealth", "Public health misinformation is endangering lives! How can health workers use policy to combat it? Get recommendations from the experts during APHA's June 14 Policy Action Institute. See you tomorrow in-person in D.C. or live online! (Not registered yet? See the link in our bio or APHA.org/PAI.) #SpeakForHealth", "What will the pending Supreme Court decision mean for abortion access? Planned Parenthood's Jacqueline Ayers will share insights at APHA's June 14 Policy Action Institute. See you tomorrow in-person in D.C. or live online! (Not registered yet? See the link in our bio or APHA.org/PAI.) #SpeakForHealth", "APHA's June 14 Policy Action Institute will kick off with a keynote from Ashish Jha, White House COVID-19 response coordinator. He's just one of many expert leaders who will be sharing public health policy insights during our one-day meeting. We're looking fwd to seeing you soon both live online and in-person in D.C. (Not registered yet? See the link in our bio or APHA.org/PAI.) #SpeakForHealth", "Just one more day until APHA's June 14 Policy Action Institute! Get ready to super-charge your work on public health policy with this special one-day event. (Not registered yet? See the link in our bio or APHA.org/PAI.) We can't wait to see you online and in-person in D.C.! #SpeakForHealth", "Gun violence is a public health issue. We know what works to prevent it. Now is the time for ACTION! Tell your senators you want them to prevent the next horrific tragedy. Change won't happen unless we demand it! Send a message now at APHA.org/action-alerts or use our link in bio #Uvalde #StopGunViolence"]