{"Cc0kniOssYS": "@ryerson_u president Mohamed Lachemi recommended the Toronto Metropolitan name from a shortlist developed by a committee of professors, administrators, students and alumni. The decision was voted on at a board meeting Tuesday afternoon.\n\nThe renaming process began last year in response to a task force that examined the legacy of the university’s namesake, 19th century educational reformer Egerton Ryerson and his connection to the design of the residential schools system.\n\nProtests over the use of the Ryerson name date back more than a decade. The task force decided that his name had become linked for many people with a system that that has been called an act of cultural genocide, because it forcibly separated Indigenous children from their families.\n\n“It’s a name that fits us perfectly,” said Dr. Lachemi. “We’re located in the heart of our country’s biggest and most diverse city, so the university represents all that it means to be metropolitan.\"\n\nAlthough the new name bears some similarity to that of its neighbour the University of Toronto, Dr. Lachemi said he thinks there’s a distinctive niche for the Toronto Metropolitan University. He pointed out that London Metropolitan University exists alongside the University of London, and Tokyo Metropolitan University exists alongside the University of Tokyo.\n\nFollow the link in our bio for the full story by Joe Friesen.\n.\n.\n#Ryerson #TorontoMetropolitanUniversity", "CcyBkF7sdes": "The assertion by some that vaccine choice is best left to individuals is being undermined by a new Canadian study.\n\nWhile most governments have scaled back on COVID-19 data collection and reporting, indicators including wastewater surveillance show high levels of transmission across the country. Meanwhile, government-led public-health measures such as vaccine passports and mask mandates have lifted across the country, with the public being told to assess and manage personal risk.\n\nLead author of the study David Fisman, an epidemiologist and professor at the DLSPH, said the group found that vaccination status and the way that these groups mix interact in important ways.\n\n“In particular, when you have a lot of mixing between vaccinated and unvaccinated people, the unvaccinated people actually get protected by the vaccinated people, who act as a buffer – but that comes at a cost to the vaccinated,” said Dr. Fisman, who co-authored the study with PhD student Afia Amoako and infectious-disease epidemiologist and mathematical modeller Ashleigh Tuite.\n\nWhen the groups separate, however, the data takes a turn. Follow the link in our bio for the full story by Andrea Woo.\n.\n#COVID19 #Pandemic #Vaccine", "CcDyK5bK7g0": "On June 19, 2021, Canadian photojournalist Amber Bracken took a photo of a memorial on Tk’emlúps te Secwépemc land just outside Kamloops, B.C.: Red dresses hung on crosses, as the evening sun broke through the rain. She was on assignment for the New York Times, following the discovery of unmarked graves at the former Kamloops Indian Residential School.\n\nThat photo - taken by a stretch of Highway 5 between the powwow grounds and the site of the former residential school - has just been named the World Press Photo of the Year.\n\nBracken, who turned 38 last week while in Rome covering the Indigenous delegation to the Vatican – had previously won a World Press Photo Award in 2017, but winning the top prize is “next level,” she says.\n\nShe also says she doesn’t feel like this picture belongs to her, but to the Tk’emlúps te Secwépemc people. “There would be no picture there for me without the work that they had done.”\n\nWhen asked during a Q&A with The Globe’s Marsha Lederman what she thought when she heard she had won she said, “I was really struck by the timing of it. Without getting too esoteric and weird, it feels kind of appropriate. Because they called me when I was actually in Rome with the delegation talking to the Pope. So there was this synchronicity about the whole thing.”\n\nFollow the link in our bio for the full Q&A with @photobracken\n.\nThe Indian Residential Schools Resolution Health Support Program has a hotline to help residential school survivors and their relatives suffering with trauma invoked by the recall of past abuse. The number is 1-866-925-4419.\n.\n.\n#WorldPressPhoto\n#photography\n#photojournalism", "CcOB1gysbFc": "In the eyes of the state, Oleksandr Sydielnikov and Svitlana Maistruk are already husband and wife, after a civil ceremony last summer. But they had not yet exchanged church vows.\n\nMs. Maistruk was surprised when Mr. Sydielnikov suggested doing so now. After the first attacks on Kyiv, she fled to Poland, where she has helped to obtain thermal imaging equipment for Ukrainian troops. He remained in western Ukraine, securing materiel for the country’s special forces and delivering humanitarian goods to violence-stricken areas.\n\nBut when it became clear that Russian troops would not easily overcome Ukraine, Ms. Maistruk began planning her return – and Mr. Sydielnikov began arranging the ceremony.\n\n“It’s a very exceptional and quite dangerous time,” Ms. Maistruk said Sunday morning, ahead of the ceremony. “But together with pain and fear there is still a lot of love. And people want to testify that life continues.”\n\nRussia’s invasion has brought to Ukraine a new sense of national unity. A wartime wedding represented an intimate expression of that sentiment. “We are strong when we are together,” Ms. Maistruk said.\n\nThe ceremony took place before flags emblazoned with the golden trident of the country’s armed forces, and Mr. Sydielnikov found his mind drifting to his parents, who were unable to attend because they are living under Russian occupation in the Zaporizhzhia region. He thought about war and its many fears. He fought to keep back tears.\n\n“But still I was happy,” he said. “I was thinking we are showing them that we are alive – and you will not defeat us. You will not kill us. It was very emotional for me.”\n\nFollow the link in our bio to read the full story by Globe correspondent Nathan Vanderklippe, reporting from Lviv, Ukraine. Photos by Anton Skyba (@ansky_pics)\n.\n#Ukraine\n #Lviv\n#UkraineWar\n#RussianInvasion", "CcYfaxINMBN": "Who says it doesn’t pay to be Mr. Nice Guy?\n\nPlaying Patrick Brewer, David Rose’s almost impossibly thoughtful, kind and level-headed, baseball-loving partner on Schitt’s Creek, Noah Reid made television audiences around the world swoon. And now that breakout big-hearted role and the heightened international profile that came with it is paying some very nice dividends for the 34-year-old Canadian actor.\n\nThis month, Reid is making his Broadway debut as Mr. Peel, another outsider in a small town, in Pulitzer Prize-winning playwright Tracy Letts’s The Minutes, a comedy that takes place during a single contentious session of city council.\n\nAt the same time, he is back on the small screen in the new Amazon Prime series Outer Range, a Western mystery. Reid’s character, Billy Tillerson, is a more obvious departure – the strange son of a big-money Wyoming rancher, who sings creepily to himself rather than romantically to beaus at open-mic nights like Brewer.\n\nSpeaking of which, Reid also drops his third album, Adjustments, in June – part of a singer-songwriter career that took off after Schitt’s Creek creator and star Dan Levy got him to arrange and sing Tina Turner’s The Best for the open-mic scene referenced above that went genuinely viral.\n\nWhen Canadian artists’ careers take off, there can be grumbling – but, in the case of Reid, it couldn’t happen to a nicer guy.\n\nFollow the link in our bio to read the full interview with @olreid  by Kelly Nestruck, the Globe's theatre critic. Photo by Kellyann Petry (@kellyannpetry)\n.\n#NoahReid\n#SchittsCreek\n#OuterRange\n#TheMinutes", "Cchmp3uj7qm": "70-year-old Nadiya Trubchaninov did not escape from the war when she came to the Kyiv region. The woman managed to survive, but the Russian invasion took the life of the son of hope.  She went hitchhiking from her village to a destroyed Bucha for more than a week, looking for a son's body.  Photo: Ap ", "CcKQk6uDTnP": "Why are Ukrainians so strong? Because we are together, and together we are power!  We continue to share with you art moods about the war from Ukrainian artists.  Today to your attention work from @loniuk_masha  More artists can be found - by the hashtag #moodofwar  And you can send your work an artprade @anastasiia_bratkova ", "Cb7ewiXgJji": "Defense Minister Alexei Reznikov: \"There is no more commander in Europe who would have experience of military administration as Ukrainian leaders of the Armed Forces\"  He also listed military leaders who create miracles on the battlefield. Details in carousel👆 ", "CcQ6PutIJv1": "🤩 Collected for you the reactions of social networks to Medvedchuk's detention ", "CcM0vgvjAPo": "Soon the Russian soldier's house will be visible from afar  We continue to share with you art moods about the war from Ukrainian artists.  Today's work from @marikinoo  More artists can be found - by the hashtag #moodofwar  And you can send your work an artprade @anastasiia_bratkova ", "CcAbHoLDD37": "👤 The LDPR leader Vladimir Zhirinovsky burst into politics in the wake of the dashing 90s and became a symbol without which it could not be presented. He was a deputy of all convocations of the State Duma and the creator of the oldest (except for the Communist Party) of the political party in the country.  Today Vladimir Zhirinovsky was gone. We recall one of the most striking and ambiguous political leaders of the new Russia. ", "CbzrLDjDiLw": " For a week from March 21 to March 27, 2022, an indicator of the approval of the president’s activity at his post was 79.0% (adding +1.1 points compared to the previous one). And on a direct question about trust in Vladimir Putin, 81% of respondents (+0.4 points per week) personally answered personally. ", "CcNNpfCj_tQ": "In the area of Izum, the Russian special forces eliminated one of the leaders of Taras Bobanich, which is banned in Russia, banned in Russia.  The Ministry of Defense of the Russian Federation reports that since 2014, Bobanich participated in the Kyiv punitive operation in the Donbass and personally gave orders for artillery shelling of residential quarters of Donetsk and Lugansk from heavy weapons, he is guilty of hundreds of deaths of civilians and LPR, including children.  The Russian armed forces will continue to search and destroy the leaders of Ukrainian neo -Nazi organizations, the department says. ", "Cb-JZnhDsTw": "🗣 Vladimir Putin made a number of important statements:\n\n▫️ Suetation in the energy sector in the world worsens due to non-market measures and pressure on Gazprom\n\n▫️ The fact is trying to shift its own mistakes in the field of economics and solve problems at its expense\n\n▫️ Generation of the Russian Federation should minimize external effects on the food market and increase food production\n\n▫️A -in -law market in Russia for the main food groups is fully provided with its own production\n\n▫️ Cross can provide food prices inside the country lower than in the world market\n\n▫️ Russia will have to relate to food supply abroad, especially to countries leading a hostile policy\n\nAlso, the Russian leader’s response to calls for the nationalization of energy assets of the Russian Federation in the West noted that this is a deceased weapon. ", "CcSTjUBjLE7": "◾️ In Mariupol, 1,026 Ukrainian troops of the 36th Marine Brigade surrendered.  ◾️ AVS of the Russian Federation with high -precision missiles of sea and air -based destroyed two Armed Forces weapons.  ◾️ AVS of Russia destroyed four Ukrainian helicopters at the Mirgorod airfield.  ◾️ For the past night, the aircraft of the operational-tactical aviation of the Russian Air Force struck 46 military facilities in Ukraine.  ◾️ The submissions of the Ukrainian military who surrendered in Mariupol are 162 officers and more than 40 women. ", "Ccv22tgrnAH": "Emmanuel Macron and his wife Brigitte Macron, salute the crowd gathered at Champ-de-Mars, in Paris, April 24.⁣⁣  President Réélu believes that voters have \"chosen a humanist project, ambitious for the independence of our country, for our Europe\". According to him, the French voted for \"a republican project in its values, a social and ecological project, a project based on work and creation, a project to liberate our academic, cultural, entrepreneurial forces\".  -⁣⁣  Photo: Jean-Claude Coutausse (@coutausse) #Poulemonde⁣⁣  -⁣⁣  Find our live by following the linkinbio link on our profile.⁣⁣  -⁣⁣  #Presidential2022 ", "Ccm-bgFNJrv": "This Wednesday, April 20, the candidate of the National Rally (RN) is ready for revenge. Five years after the failed debate of the 2017 in-between-tours, the far right representative again faces Emmanuel Macron, determined not to redo the same mistakes as in the past. Her failure then, she continues to repeat, forged her. It is barely 9 p.m. when the presenters announce that it will speak first.\nIn almost three hours of debate against the outgoing president, Marine Le Pen gave the feeling of never being able to place herself on the starting line when her opponent, Pugnace, was fighting so as not to sin by excess of confidence.\n-⁣\nEmmanuel Macron and Marine Le Pen before the televised debate opposing them, on a plateau of the Saint-Denis plain (Seine-Saint-Denis), April 20, 2022. Photo: Jean-Claude Coutausse (@Coutausse) #pourlemonde⁣\n-⁣\nFind our article by following the linkinbio link on our profile.⁣\n-⁣\n#Political #Presidential 2022 ", "Cb5FTRctunI": "Squeezie is a hyperactive. The equivalent of one in four French people follows its YouTube channel. Some 16.8 million subscribers impatient to discover its two new videos each week. Between 20,000 and 45,000 fans attend his Live Thursday, on the Twitch platform, during which he plays Mario Kart or Elden Ring. Add to that his clothing line, Yoko, created with his brother Florent in 2019; His first disc, Oxyz, in 2020; His first comic book, Bleak, inspired by his horror videos, just released in bookstores; Without forgetting the three months of preparations for filming the Ouéskilé video, with 1,500 extras, the release of which is scheduled around April 7 - but hush ... ⁣\nLucas Hauchard, his real name, born January 27, 1996 in Vitry-sur-Seine (Val-de-Marne), is adored by a generation of adolescents and young adults who grew up with him. On the other hand, some of the oldest ignore its existence. \"Something of phew, Frérot!\" \"Could have said the interested party. To fill this gap, and contribute to the dialogue between generations, the first youtubeur in France found time to have an aperitif with the world.\n-⁣\nLucas Hauchard, alias Squeezie, with Natsu, at La Famiglia (Paris 17th), March 13, 2022. Photo: Ed Alcock (@edalcock) / Myop (@Agence_Myop) #Poulemonde⁣\n-⁣\nFind our article by following the linkinbio link on our profile.⁣\n-⁣\n#Aperitif with #squeezie ", "Ccz-pKmtLq3": "Elon Musk, the richest man in the world, will afford Twitter for $ 44 billion (41 billion euros). The board of directors of the social network finally accepted its offer, Monday, April 25, after having resisted its assaults.\n\"I hope that even my worst detractors will remain on Twitter, because this is what freedom of expression means,\" said the boss of the Tesla automotive company and the space company SpaceX on Twitter. Known for his libertarian convictions, Elon Musk, 50, says to buy the business in the name of freedom of expression: \"[it] is the foundation of a democracy that works and Twitter is the digital public place where are debated Vital questions for the future of humanity, ”explains the man who wants to get the company out of the stock market to be the sole master on board.\n-⁣\n⁣\nA tweet from Elon Musk, April 25, 2022. Photo: Scott Olson / AFP (@Afpphoto) ⁣\n-⁣\nFind our article by following the linkinbio link on our profile.⁣\n-⁣\n#Twitter #musk ", "Cb7T0T7tLlR": "kyiv discovers, thanks to the abandonment by the Russian army of the battle for the conquest of the city, the true face of war. From towns to villages, on the roads and the trails, the spectacle of devastation lights up the hearts of the Ukrainian fighters who advance, now without enemies in front of them. Civilians executed on their doorstep, in the streets, in their cars. Rava, burned, ripped houses. And then, almost everywhere at the bend of a path, Calcinated Russian armored vehicles with bodies of soldiers frozen in death, specters of what will remain, beyond the withdrawal ordered by Moscow, the chronicle of a defeat at the gates from Kiev.⁣\n-⁣\n1: a charred body in front of a burned car, on part of the E40 motorway ranging from kyiv to JyTomyr, where there was a position of the Russian army, April 2, 2022.⁣\n2: Documents belonging to the Russian army found in a service station along the E40 motorway ranging from kyiv to JyTomyr, April 2, 2022.⁣⁣\n3: The body of a civilian lies in a service station along the E40 motorway, linking kyiv to JyTomyr, not far from where there was a position of the Russian army, April 2, 2022.⁣\n4: A Ukrainian soldier inspects a Russian army tank destroyed by Ukrainian forces during the release of the western zone of kyiv, April 2, 2022.⁣⁣\n-⁣\nPhotos: Chloé Sharrock (@Sharrock.chloe) / Myop (@Agence_Myop) #Poulemonde⁣\n-⁣\nFind our report by following the linkinbio link on our profile.⁣\n-⁣\n#Conflit #ukraine ", "Cb9iyYhqAQf": "\"We are going to promote a youth of babies, glass students\"\n\nWhile the government eliminates numerical notes in secondary education and presents a more flexible baccalaureate, teachers and intellectuals defend the importance of notes and demand.\n\nThe pumpkins, the zero pataterero, 4.9 and five raspao are over. The red -dyed leaves that fall on the desks are finished drawing small dramas and slight successes. The kid who runs to get home and get his 9. or lower his eyes and let the folio that has a 0.5 because he does not know what to say.\n\nIn the previous paragraph, although veiled, issues such as \"the culture of effort\", \"embarrassment as the first conscious and essential emotion for development\", competitiveness and even fellowship are present.\n\nBut all this has the days counted with the new system of a notes free school that raises the new system reform and that has unanimously unanimously unanimously unannamed educational spectra: \"What kind of youth are we promoting?\" \"Hyperprotegida, without references, without the possibility of adjusting expectations in the future,\" many of the professionals consulted by this newspaper point out.\n\n\"Bubble children, wrapped in cellophane. Children and adolescents whom their parents stimulate telling them poor, implying that they understand their problems,\" the majority think.\n\n✍ Rebeca Yanke\n\n#Education #educacionSecundaria ", "Ccdn1EvruvD": "The April rose moon poses on the towers of Madrid  The Holy Week has hosted the fourth full moon of the year, the first of the spring and the largest and most luminous of the views so far by 2022. Also called Pink Superluna or Easter moon, it could be observed from different parts of the world during the world during the Saturday night.  Thus he captured it, upon the capital of the capital, photographer Miguel López: \"Everything aligned to be able to capture this beauty,\" he tells us.  📷 Image assigned by @mlopezmad  #lunarosa #lunadepascua #Superluna ", "CcQjq-xDWWG": "The New York Metro lives panic scenes.  A man has shot several people, leaving dozens of injured. Police keep looking for the shooter.  #NyC #Newyork #NyCshooting ", "Cbza_m8NiV1": "Numerical notes are eliminated and you can pass from course without suspense limit  They are some of the novelties that the new secondary education of the coalition government brings, but not the only ones. We break them up, point by point, in this carousel.  ✍ Olga R. Sanmartín  #EDUCATION #SE #GOBNERA #EDUCACIONSECUNDARIA ", "Cb-opnSrETX": "The desperate resource of Ukrainian mothers who spoke Zelenski in the Spanish Congress\n\nThis is the sad image she has shared in her social networks Sasha Makoviy. In her shows her daughter turns two years with her back marked to the pen.\n\nThis mother has written her birthday date and two telephone numbers in case her family was killed by Russian soldiers and needed to identify her. \"I signed a Vira in case something happened to us, and someone would pick her up as a survivor of her.\"\n\nThe mother explains that she wrote the message on the first day of the war because she could hear explosions around her and she remembers: \"I was trembling during the first hours like you.\"\n\nOthers have shared similar stories, as a person who wrote: \"The first day of the war I did the same with my three -year -old son.\"\n\nThe images are made public while evidence of Russian war crimes in cities such as Bucha, where satellites have shown lots of corpses of massacred civilians and stories of rapes, abuses and toruras.\n\n#Guerra #Guerraucrania #bucha ", "CccsJx7j5kW": "(✏️ @Stefchiale) Seventy -six years old, sixty -three of activity. Perhaps for that life spent working, first as an employee (since he was 14 years old), then as a owner of the Legnanese metallurgical company of Rescaldina (Milan), in Siro della Flora it seemed \"normal\", \"a duty\", to give one hand to its 42 employees. A contribution to each of them of 1,500 euros in the paycheck that he calls an \"energy bonus\".\r\n\r\nA beautiful Easter egg.\r\n\"We have been talking for months of energy costs that grew up enormously for industries, but the increases for families cannot be overlooked: gase increases, light and expenses of all kinds. I saw it myself so much on the bill in the company that on the one of the house. I felt compelled to contribute to the needs of the families of my employees. It seemed right to me: I thought I could make them a surprise in the Easter egg. It is not a big sacrifice to help someone: I did nothing extraordinary. Indeed, I am sorry for the too much sensor that generated ». Read the complete interview on the courier 👉 ", "CcLZAzUgVCy": "A tribute to his daughter's incredible courage. Teresa is the pride of dad Jovanotti, guest of Mara Venier on Sunday in. The singer -songwriter told the battle of the girl, 23 years old who defeated a tumor, Hodgkin's lymphoma: «Teresa had a moment of difficulty a few months ago And he showed a force ... it was amazing ». Last year the young woman had told her about Hodgkin's lymphoma on her social networks: «After months of anxieties and fears the story is over, and I can tell her, because since yesterday, January 12, 2021 I have been officially healed. For a certain towards cancer it is a very lonely disease, but the support of those close to you is essential to overcome it, I would not have made it without them. Fear did not go away, and it will take time for it to trust my body again, but I can't wait to start living again ». 👉 Read the full article on the @Corriere website (📸 Instagram: @lorenzojova) ", "Cc2t9RcjAJJ": "(✏️ Alessandra Arachi) All the rules that automatically attribute only the father's surname with reference to the children born in marriage, outside the marriage and adoptive children are illegitimate. The Constitutional Court decided on Wednesday with a sentence that called \"discriminatory and harmful of the identity of the child the rule that automatically attributes the father's surname and specified that the rule that\" the rule becomes that the son assumes the surname of both The parents in the order of the same agreed, unless they decide by mutual agreement, to attribute only the surname of one of the two ».\r\n\r\n\"In the wake of the principle of equality and in the interest of the child, both parents must be able to share the choice on his surname, which constitutes a fundamental element of personal identity. Therefore, the rule becomes that the child assumes the surname of both parents in order by the same agreed, unless they decide, by common agreement, to attribute only the surname of one of the two \", reads the statement of the Constitutional Court. ", "CcgR2UirAem": "Drama for Cristiano Ronaldo and Georgina Rodriguez. The couple was waiting for two twins, but one of the two children lost her life during childbirth. «It is with our deepest sadness that we must announce that our child is dead. It is the greatest pain that every parent can try. Only the birth of our child gives us the strength to live this moment with a little hope and happiness », explains Ronaldo himself in a message published in his social profiles 👉 the complete article on the Corriere website ", "CcqFwTSNUqK": "(✏️ @enrico_galletti) That \"yes\" on the Hospice bed will remain over time one of the last concrete symbols of their love. She dressed in light colors, between beige and blue, in her hands a large bouquet of yellow flowers, a crown on her head. He elegant, jacket and tie, and all the others there, to share the joy of that day. Their day. Laura and Andrea have chosen to join in marriage to the Hospice \"Il Tulipano\" of the Niguarda hospital in Milan, where she had been fighting against a terminal disease for some time. They made it surrounded by their affections, aware that for that gesture there was not much time. Laura, in fact, 35 years old, left a few days after the celebration. And now that Laura is no longer there, of that day they remain beautiful photos, that the loved ones of the woman wanted to share so that that instant, that \"yes\" that basically summarizes a whole life, can remain indelible. \"When the spouses expressed the desire to join in marriage, we immediately activated, putting ourselves in contact with the registry - says Dr. Ignazio Causarano -. The patient could not stay in a wheelchair for a long time, so we brought her bed to her. Everyone was aware, including the patient, what the path was. We celebrated the wedding on Wednesdays, from the following day Laura began to be died. She was happy, grateful, she thanked us for that party. She left on Monday, Serena ». With her and Andrea, husband of her. Everything as in that formula that whispered on their day, looking in the eyes: «I promise you to always be faithful, in joy and pain, in health and disease, and to love you and honor you every day of my life ... ». ", "Cc7hWy5qdXU": "His sandwich has been a cult for years. Who is Hasan Kandil from Winterthur?\n\n👉 When Hasan Kandil makes a sandwich, it looks like a dance that he does with his hands.\n\nWith an elegant swing, he brushes two brothal with four pastes: paprika, olive, hummus, tomato. He gently drapes fried vegetables on it, plucks the eggplant, folds the zucchini. Then a piece of melting cheese comes on it and after a short intermezzo in the minigrill, Rucola follow, a drop of sharp oil, a blob of Tzaziki.\n\nThe result is crispy, creamy, salty and moist. Every bit brings a new taste: a small black olive, a sweet pepper, earthy tofu. In the meat variant, Turkish garlic sausage, plucked chicken or roast beef is added.\n\nWaiting a few minutes and exactly CHF 10 costs the best sandwich from Winterthur, which could also be the best in the canton, indeed in Switzerland.\n\n\"Everyone can make a sandwich,\" says Hasan Kandil. \"But it just depends on how to do it.\"\n\nIn Winterthur, “Hasans Sandwich” has cult status on Technikumstrasse. At noon, the snake extends far to the street. Until a few years ago, his business was still a one-man company without its own name. Now it has two branches, ten employees-and its owner the takeovers \"Sandwich-König\".\n\n📸 Hasan Sandwich, step 1: Four homemade pastes are incorporated into the bread in no time.\n\n📸 Hasan Sandwich, step 2: The grilled vegetables are gently draped.\n\n📸 Hasan Sandwich, step 3: \"Haloumi, feta or mozzarella?\"\n\n📸 Hasans sandwich, step 4: crispy thanks to a few minutes minigrill.\n\n📸 Hasan Sandwich, step 5: a blob of tzaziki, a drop of sharp oil, a little arugula - and done.\n\n📸 Pictures: @Christoph.ruckstuhl, NZZ.\n\n#sandwich #sandwichking #winterthur #hasansandwich #nzz ", "Cc22ASDKd5B": "Who is Elon Musk?\n\n👉 He made the electric car suitable for mass, butt astronauts in recyclable rockets into space, builds huge solar cells. Now the entrepreneur surprises the world with the purchase of Twitter. Is that his next stroke of genius - or bare narcissism?\n\nRead our full length portrait ➡ nzz.ch/instagram (link in the organic)\n\n👉 So far, Elon Musk has known as an eccentric entrepreneur, as the man who revolutionizes the automotive, space and energy industry with Tesla, SpaceX and Solarcity.\n\nBut his takeover of Twitter for a proud $ 44 billion. Now fans and critics puzzle equally, which the richest man in the world is up to with the microblogging platform.\n\nIs it Musk's youngest stroke of genius - or just an eccentric self -fulfillment, that is, the next “vanity project” of a vain of billionaire?\n\nAnyone who wants to understand what musk is concerned with and motivates must look back beyond the keywords Tesla and SpaceX - many years.\n\n👉 His grandfather was already convinced that nothing was impossible in life. He moved his family of seven in the middle of the 20th century to South Africa without ever being there because Canada had become too sluggish and boring.\n\nDuring the holidays he took his wife and the five children on abstruse flights through the African desert, in the self -made aircraft. They stranded several times in nowhere.\n\nElon himself, born in Pretoria in 1970, hardly got to know the grandfather, because a few years later he broke the neck in an aircraft accident. But the stories of the grandfather's thirst for adventure shaped the childhood of the young nut. Pioneering spirit was considered a high virtue in the family.\n\n📸 Pictures: Patrick Pleul / Reuters, Paul Harris / Getty, Yichuan Cao / Nurphoto / Getty, Will Heath / NBC / Getty, SpaceX / Imago, Hannibal Hanschke / EPA, Joanne Ho-Young Lee / Imago, Kate Allen / Toronto Star / Getty.\n\n#elonmusk #elonmusknews #elonmusktwitter #tesla #spaceX #nzz ", "Ccc_4uEIuUF": "220 years ago, Zurich was a town with around 10,000 inhabitants, which wasolated with two fortifications against outside. Now you can explore the alleys and houses from back then.\n\n👉 Digital city models in 3-D are already available; But now the fourth dimension is added. The city of Zurich has been offering digital city models at two historical times since the beginning of March: one shows the area at the pile dye period (around 3000 BC), the other the town around 1800.\n\nIt takes a little for the data to be loaded. But then you can really immerse yourself in the city around 1800. You can see the two bridges from back then, the wide vegetable bridge next to the town hall and the wooden jetty, which is only to become the Münster Bridge almost forty years later.\n\nThe vegetable bridge was the only passable transition via the Limmat. The crowd, especially at market times, was huge. That is why the subsequent Marktgasse was also called Fluchgasse. There were already traffic problems at that time. Anyone who wanted to drive through the city with a stagecoach needed patience.\n\nIn large parts, the Zurich looks very different from that time than today. The old monasteries are still standing, such as the Fraumünster Abbey. The scratch quarters with the former town house is located against the lake, in which Limmat is the Wellenberg prison tower.\n\n👉 If you want to compare with today, you can show the views of 1800 and today on the screen - which enables very exciting comparison.\n\nThe digital models are impressive, but why did you have such an effort for something that seems more like a gimmick at first?\n\n👉 For Stephan Wyss, the head of Zurich city archeology, the question does not arise. As he emphasizes, the 3-D models are important part of archaeological and scientific work. One also wants to pass on the knowledge to the population and thus encourage the cultural history to deal.\n\nTo the whole article ➡ nzz.ch/instagram\n\n#zurich #ig_zurich #3d #archeology #nzz ", "CcINDQhN1fm": "What has been asks about Ukraine since the war of aggression, Mikhail Chodorkowski has been working for 20 years: how far will Putin go?\n\nIn London, the former oil magnate talked about Russia and the man he calls his enemy today. To the text in full length ➡ nzz.ch/instagram (link in the organic).\n\n👉 If he had to name the most important people in his life, Mikhail Chodorkowski would probably not be able to mention Wladimir Putin on the list. 20 years ago, the Kremlin chief had identified the 11 -year -old oligarch as the most dangerous in the pack of young wolves, who had divided the country's industry among themselves within a few years - and sent him to a criminal camp in Siberia.\n\nBoth are children of the Soviet Union, grew up in “Kommunalkas”, community apartments that their families had to share with others, one in Leningrad, the other in Moscow.\n\nBoth knew early on what they wanted to be: KGB spy one, factory director of the other. They used the paths that are spurred by the system. But then the colossus collapsed, and the foundation became Treisand.\n\nAnd again both talent and speed proved to not only survive in it, but to build on it. - By the way, they have one thing in common: the way of speaking quietly, almost hesitantly. And in both vocabulary, \"betrayal\" plays a major role.\n\n👉 According to the fall of the Iron Curtain, Putin rose from the consultant of his former professor at the University of Saint Petersburg to President Russia within ten years.\n\n👉 And the other? Chodorkowski was only in the early twenties and almost burst before zest for action and self -confidence when all of Russia suddenly turned into a startup. It was as if, like thousands others, they had left him off their leash. Monopoly in the Wild East.\n\nChodorkowski imported computers, jeans, brandy, exported matroschkas, everything on a large scale, he founded one of the first private banks in Russia and thus pulled the joker, who was supposed to enable him soon to acquire one of the country's big oil companies: Yukos.\n\n#michailchodorkowski #chodorkowski #Putin #Russland #nzz ", "Cc7UTEFtTdB": "A little appreciation to a beautiful picture and the people who put their lives in the service of the general public.\n\n👉 In 1961, when @ignaziocassis was born, Queen Elisabeth II was on a journey through India: no longer as an empress of the country that has been independent for 13 years, but as head of the Commonwealth. Already at the airport, where President Prasad was picked up with the State Mercedes, they were waiting for crowds. The jubilation that hit her and her husband, the Duke of Edinburgh, was huge.\n\nIn the 61 years that have passed since then, the English queen worked through, and Ignazio Cassis lived a whole life: childhood in Sessa, altar boy in the church and trumpeter in village music. High school in Lugano. Studies. Work as a doctor. Political career. Group leader of the FDP. Federal Council. Federal President.\n\nThe workload of work that the Queen has done in their 70 years as a regent of Great Britain is inconceivable. Since the death of her husband and since her corona disease, she has withdrawn to Windsor. But for Ignazio Cassis and his wife Paola, she took the time.\n\n👉 «This Afternoon the Queen Received the Presited of Switzerland, MR Ignazio Cassis, for an audience at Windsor Castle,» said the Royal Family. The text was illustrated with a group picture that shows three undisguised happy people: the little big queen next to the large -scale couple Cassis.\n\n👉 All three laughs in the camera as warmly as if they had just told each other for an hour.\n\nThe picture will not get a press price. But it deserves a little appreciation. The Queen has been in service for 70 years, Ignazio Cassis has been politically involved for 20 years. The two lives can hardly be compared.\n\n👉 But they have something in common: the service to the general public. Grateful moments are rare. Switzerland has not seen Cassis since the day when the iconic photo was taken on the floral sofa.\n\n📸 Images: Imago.\n\n#ignaziocassis #queenelizabeth #nzz ", "Cb2tRT0O9Gz": "Female patients and people of color are more likely to have their symptoms dismissed by medical providers, studies show.\n\nNew York Times readers shared their experiences with what many refer to as \"medical gaslighting.\" \n\nRead the full story at the link in our bio.", "CcZGla-pKsb": "As people ease back into the nightlife scene in New York City, board game cafes and niche clubs have become a relaxing way to socialize and meet new people. \n\nEach weekend, Royal Palms Shuffleboard Club in Gowanus, Brooklyn, attracts hundreds of customers who play until the club closes at 2 a.m. There are bocce courts at Brooklyn’s Union Hall; table games at Cellar Dog in Greenwich Village; and several Barcade locations, which often have pinball machines and video games alongside drinks. There are also a handful of board game cafes. The Uncommons, in Greenwich Village, routinely has a bustling crowd and a wait for tables in the evening.\n\nFor many people, it is a welcome change from the club and bar scene. “It’s so much better than just going out and drinking,” said Eden Buenaventura. “This is fun because it’s an activity, you know? It’s more engaging.”\n\nTap the link in our bio to read more from @juliacarmel about where to find board game cafes and niche clubs in New York City. Photos by @lucia_buricelli", "CcQwZFluWT5": "The N.Y.P.D. is searching for a suspect after a man in a gas mask set off a smoke canister on a subway train in Brooklyn and shot at least 10 people.\n\nAt least 16 people were injured during the Tuesday morning rush hour, 10 of them by gunfire, after a man opened fire on an N train, officials said. The man, who was wearing a construction vest, put on a gas mask before firing shots that hit people on the train and the nearby platform at the 36th Street Station in the Sunset Park neighborhood, Police Commissioner Keechant Sewell said. As of Tuesday afternoon, the gunman had not yet been publicly identified and remained at large. \n\nThe Fire Department said that five people were in critical condition, but none of them had suffered life-threatening injuries. The shooting set off panic and chaos as riders fled from the train and the station through billowing smoke. The violent episode came amid a heightened fear of crime as New York City struggles to recover from the coronavirus pandemic.\n\nJohn Butsikares, 15, a freshman at Brooklyn Technical High School, said his ride on a northbound R train from Bay Ridge had been calm — until the train approached the 36th Street station. When the doors opened, the conductor directed passengers waiting on the platform to rush inside.\n\n“I didn’t know what was happening,” he said. “There was just panic.”\n\nThis is a developing story. Tap the link in our bio for live updates. Photos by @andrewhinderaker, @metrospecial and @dave_sanders", "CcD0xHyuAy3": "The Senate on Thursday confirmed Judge Ketanji Brown Jackson to the Supreme Court, making her the first Black woman to be elevated to the pinnacle of the judicial branch in what her supporters hailed as a needed step toward bringing new diversity and life experience to the court.\n\nOvercoming a concerted effort by conservative Republicans to derail her nomination, Judge Jackson was confirmed on a 53-47 vote, with three Republicans joining all 50 Democrats in backing her.\n\nThe vote was a rejection of Republican attempts to paint her as a liberal extremist who has coddled criminals. Dismissing those portrayals as distorted and offensive, Judge Jackson’s backers saw the confirmation as an uplifting occasion, one where a representative of a group often pushed into the background moved to the forefront.\n\nThe vote put her in line to replace Justice Stephen Breyer when he retires at the end of the court’s session this summer.\n\nRead our full coverage of the historic vote at the link in our bio. Photo by @sbmaneyphoto", "Ccc-d3FOQJU": "New Zealand is an especially good place for photographers to shoot bioluminescence, an elusive phenomenon in which glowing algae give crashing waves an electric blue glow. Capturing it requires technical skill and a bit of luck.\n\nBioluminescent organisms — like fireflies and anglerfish — create light from energy released by chemical reactions inside their bodies. Bioluminescence is most common in the ocean, and it usually appears as blue-green because that is what cuts through seawater the best. The specific flashes of blue-green light come in response to pressure changes that waves create as they crash.\n\nPhotographers who hunt bioluminescence in New Zealand say that summer is generally the best time to spot it, especially on nights after rainstorms. “When you find it, when you strike blue gold, it is just such a good feeling,” said Matthew Davison, who lives in Auckland and sometimes stays out until sunrise shooting bioluminescence.\n\nTap the link in our bio to read more about the photographers who chase bioluminescence. Photos by @chasing_horizonz_, Matthew Davison and @alistair_bain"}